[
  {
    "id": "EU-IT-001",
    "region": {
      "en": "Europe",
      "zh": "欧洲",
      "sv": "Europa"
    },
    "subcategory": {
      "en": "Italy",
      "zh": "意大利",
      "sv": "Italy"
    },
    "dish_name": {
      "en": "Pasta Carbonara",
      "zh": "培根蛋酱面",
      "sv": "Pasta Carbonara"
    },
    "description": {
      "en": "A classic Roman dish made only with egg yolk, Pecorino cheese, guanciale (or bacon), and black pepper.",
      "zh": "一道经典的罗马菜肴，仅用蛋黄、佩科里诺奶酪、意大利腌猪颊肉（或培根）和黑胡椒制成。",
      "sv": "En klassisk romersk rätt gjord endast med äggula, pecorinoost, guanciale (eller bacon) och svartpeppar."
    },
    "total_time_min": 30,
    "difficulty": {
      "en": "Medium",
      "zh": "中等",
      "sv": "Medel"
    },
    "servings": 4,
    "main_type": {
      "en": "Meat",
      "zh": "肉类",
      "sv": "Kött"
    },
    "ingredients": {
      "en": [
        "4 servings spaghetti",
        "2 packs bacon (140 g each)",
        "4 eggs",
        "1 dl whipping cream",
        "2 dl grated parmesan",
        "1/2 tsp salt",
        "2 tsp freshly ground black pepper",
        "To serve",
        "65 g arugula"
      ],
      "zh": [
        "4份意大利面",
        "2包培根（每包140克）",
        "4个鸡蛋",
        "1分升鲜奶油",
        "2分升帕玛森芝士碎",
        "1/2茶匙盐",
        "2茶匙现磨黑胡椒",
        "佐餐配料",
        "65克芝麻菜"
      ],
      "sv": [
        "4 port spaghetti",
        "2 förp bacon (à 140 g)",
        "4 ägg",
        "1 dl vispgrädde",
        "2 dl riven parmesan",
        "1/2 tsk salt",
        "2 krm nymalen svartpeppar",
        "Till servering",
        "65 g rucola"
      ]
    },
    "steps": {
      "en": [
        "Cook the spaghetti according to the instructions on the package.",
        "Cut the bacon into about 2 cm pieces. Fry the bacon pieces until crispy in a frying pan.",
        "Whisk together the eggs (both egg whites and yolks), cream, parmesan cheese, salt and black pepper in a bowl.",
        "Drain the pasta and pour it back into the saucepan, fold in the egg mixture and the fried bacon. Stir over low heat until the pasta is creamy.",
        "To serve: Serve the carbonara topped with rocket and add a few extra touches of pepper."
      ],
      "zh": [
        "按照包装上的说明煮意面。",
        "将培根切成约 2 厘米的小块。在煎锅中将培根块煎至酥脆。",
        "在一个碗中，将鸡蛋（蛋清和蛋黄）、奶油、帕玛森奶酪、盐和黑胡椒搅拌均匀。",
        "沥干意面，倒回锅中，拌入蛋液和煎好的培根。小火慢煮，不断搅拌至意面浓稠顺滑。",
        "食用方法：将卡邦尼意面盛入盘中，撒上芝麻菜，再撒上少许黑胡椒即可。"
      ],
      "sv": [
        "Koka spaghettin enligt anvisningen på förpackningen.",
        "Klipp bacon i ca 2 cm stora bitar. Stek baconbitarna knapriga i en stekpanna.",
        "Vispa ihop ägg (både äggvita och -gula), grädde, parmesanost, salt och svartpeppar i en bunke.",
        "Häll av pastan och häll tillbaka den i kastrullen, vänd ner äggblandningen och det stekta baconet. Rör runt på svag värme till en krämig pasta.",
        "Till servering: Servera carbonaran toppad med rucola och dra några extra tag med pepparkvarnen över."
      ]
    },
    "tags": [],
    "cooking_method": {
      "en": "",
      "zh": "",
      "sv": ""
    },
    "tips": {
      "en": "Serve with an extra egg yolk.",
      "zh": "佐以额外的蛋黄。",
      "sv": "Servera gärna med en extra äggula."
    },
    "taste_preferences": [
      "rich",
      "salty"
    ],
    "image_url": "/Recipe Image/Europe/EU-IT-001.png"
  },
  {
    "id": "EU-IT-002",
    "region": {
      "en": "Europe",
      "zh": "欧洲",
      "sv": "Europa"
    },
    "subcategory": {
      "en": "Italy",
      "zh": "意大利",
      "sv": "Italy"
    },
    "dish_name": {
      "en": "Margherita Pizza",
      "zh": "玛格丽特披萨",
      "sv": "Margherita Pizza"
    },
    "description": {
      "en": "This iconic Neapolitan pizza features tomato, mozzarella, and basil, symbolizing the Italian flag.",
      "zh": "这款标志性的那不勒斯披萨以番茄、马苏里拉奶酪和罗勒为特色，象征着意大利国旗。",
      "sv": "Denna ikoniska napolitanska pizza innehåller tomat, mozzarella och basilika, som symboliserar den italienska flaggan."
    },
    "total_time_min": null,
    "difficulty": {
      "en": "Medium",
      "zh": "中等",
      "sv": "Medel"
    },
    "servings": 4,
    "main_type": {
      "en": "Grain",
      "zh": "谷物",
      "sv": "Spannmål"
    },
    "ingredients": {
      "en": [
        "Pizza dough",
        "3 1/2 dl ice-cold water",
        "50 g fresh yeast",
        "2 tbsp oil",
        "1/2 tbsp salt",
        "10 dl flour (10 dl corresponds to approx. 550 g) + extra for baking",
        "Tomato sauce",
        "1 yellow onion",
        "2 cloves of garlic",
        "2 tbsp olive oil",
        "1 pack whole tomatoes (400 g each)",
        "2 tbsp tomato paste",
        "1 tsp dried oregano",
        "1 tsp dried thyme",
        "1/2 tsp chili powder",
        "salt",
        "black pepper",
        "Topping",
        "2 mozzarella (125 g each)",
        "fresh basil"
      ],
      "zh": [
        "披萨面团",
        "3.5分升冰水",
        "50克鲜酵母",
        "2汤匙油",
        "0.5汤匙盐",
        "10分升面粉（约550克）+ 额外面粉用于烘焙",
        "番茄酱",
        "1个黄洋葱",
        "2瓣大蒜",
        "2汤匙橄榄油",
        "1包整番茄（每个400克）",
        "2汤匙番茄酱",
        "1茶匙干牛至",
        "1茶匙干百里香",
        "0.5茶匙辣椒粉",
        "盐",
        "黑胡椒",
        "馅料",
        "2块马苏里拉奶酪（每块125克）",
        "新鲜罗勒"
      ],
      "sv": [
        "Pizzadeg",
        "3 1/2 dl iskallt vatten",
        "50 g färsk jäst",
        "2 msk olja",
        "1/2 msk salt",
        "10 dl mjöl (10 dl motsvarar ca 550 g) + extra till utbakning",
        "Tomatsås",
        "1 gul lök",
        "2 vitlöksklyftor",
        "2 msk olivolja",
        "1 förp hela tomater (à 400 g)",
        "2 msk tomatpuré",
        "1 tsk torkad oregano",
        "1 tsk torkad timjan",
        "1/2 tsk chilipulver",
        "salt",
        "svartpeppar",
        "Topping",
        "2 mozzarella (à 125 g)",
        "färsk basilika"
      ]
    },
    "steps": {
      "en": [
        "Note: It takes about six hours to prepare the dough.",
        "Pizza dough: Pour the water into a stainless steel bowl, add the yeast and the oil. Whisk everything together. Add the salt.",
        "Pour in the flour, knead or let the dough machine work the dough into a smooth dough ball.",
        "Let the dough rise for 1-1 1/2 hours in a large dough bowl.",
        "Take out the dough, divide and shape it into 4 equal-sized pieces (for 4 servings). Place on a plate and place in the refrigerator with a wet towel over it. Let stand for at least 5 hours.",
        "Tomato sauce: Peel the onion and garlic. Grate or chop finely. Fry the onion and garlic in olive oil in a saucepan for about 3 minutes. Add the tomatoes, tomato paste and spices. Mash the tomatoes with a wooden spoon. Let cook over low heat for about 15 minutes without a lid. Season with salt and pepper.",
        "Set the oven to 250°C. Place a baking sheet in the oven",
        "Pizza base: Shape pizza bases by sprinkling flour generously under and over the dough and working with your fingertips from the center out to the edge to a diameter of 25-30 cm. Leave 1-2 cm of the edge untouched, so that the pizzas have nice edges.",
        "Place the bases on baking paper and let rest for 15 minutes.",
        "Top each pizza with a thin layer of tomato sauce and 1/2 sliced ​​mozzarella. Transfer the baking paper with the pizza onto the hot baking sheet and bake one pizza at a time, in the middle of the oven for 10-15 minutes at 250°C.",
        "Top the pizza with fresh basil."
      ],
      "zh": [
        "注意：准备面团大约需要六个小时。",
        "披萨面团：将水倒入不锈钢碗中，加入酵母和油。搅拌均匀。加入盐。",
        "倒入面粉，揉面或使用揉面机揉成光滑的面团。",
        "将面团放入大面团碗中，醒发 1-1.5 小时。",
        "取出面团，分成 4 等份（4 人份）。放在盘子上，盖上湿毛巾，放入冰箱冷藏至少 5 小时。",
        "番茄酱：将洋葱和大蒜去皮，磨碎或切碎。在平底锅中用橄榄油将洋葱和大蒜炒约 3 分钟。加入番茄、番茄酱和香料。用木勺将番茄捣碎。小火慢炖约 15 分钟，不要盖盖子。用盐和胡椒粉调味。",
        "将烤箱预热至 250°C。将烤盘放入烤箱。",
        "披萨饼底：在面团上下均匀撒上大量面粉，用指尖从中心向外擀成直径25-30厘米的饼底。边缘留出1-2厘米的空白，使披萨饼边整齐美观。",
        "将饼底放在烘焙纸上，静置15分钟。",
        "在每个披萨饼底上涂抹一层薄薄的番茄酱，并放上半片马苏里拉奶酪。将铺有烘焙纸的披萨饼底转移到预热好的烤盘上，放入预热至250°C的烤箱中层，一次烤一个披萨，烤10-15分钟。",
        "最后撒上新鲜罗勒叶。"
      ],
      "sv": [
        "Obs! Det tar ca sex timmar att förbereda degen.",
        "Pizzadeg: Häll vattnet i en rostfri bunke, tillsätt jäst och oljan. Vispa ihop allt. Tillsätt saltet.",
        "Häll i mjölet, knåda eller låt degmaskinen arbeta degen till en jämn degboll.",
        "Låt degen jäsa i 1-1 1/2 timme i en stor degbunke.",
        "Ta upp degen, dela och forma den i 4 jämnstora bitar (för 4 port). Lägg upp på ett fat och ställ in i kylen med en blöt handduk över. Låt stå i minst 5 timmar.",
        "Tomatsås: Skala lök och vitlök. Riv eller hacka fint. Fräs lök och vitlök i olivolja i en kastrull ca 3 minuter. Tillsätt tomaterna, tomatpuré och kryddor. Mosa tomaterna med en träslev. Låt koka på svag värme ca 15 minuter utan lock. Smaka av med salt och peppar.",
        "Sätt ugnen på 250°C. Sätt in en plåt i ugnen",
        "Pizzabotten: Forma pizzabottnar genom att strö ordentligt med mjöl under och över degen och jobba med fingertopparna från mitten ut mot kanten till 25-30 cm i diameter. Lämna 1-2 cm av kanten orörd, så blir det fina kanter på pizzorna.",
        "Placera bottnarna på bakplåtspapper och låt vila i 15 minuter.",
        "Toppa varje pizza med ett tunt lager tomatsås och 1/2 skivad mozzarella. Dra över bakplåtspappret med pizzan på den varma plåten och grädda en pizza i taget, mitt i ugnen 10-15 minuter i 250°C.",
        "Toppa pizzan med färsk basilika."
      ]
    },
    "tags": [],
    "cooking_method": {
      "en": "",
      "zh": "",
      "sv": ""
    },
    "tips": {
      "en": "Serve with truffle burrata. If you're short on time, make pizza dough with baking powder instead.",
      "zh": "搭配松露布拉塔奶酪食用。如果时间紧迫，可以用泡打粉代替面粉制作披萨面团。",
      "sv": "Servera gärna med tryffelburrata. Om du har ont om tid, gör pizzadeg med bakpulver istället."
    },
    "taste_preferences": [
      "mild",
      "sour",
      "rich"
    ],
    "image_url": "/Recipe Image/Europe/EU-IT-002.png"
  },
  {
    "id": "EU-IT-003",
    "region": {
      "en": "Europe",
      "zh": "欧洲",
      "sv": "Europa"
    },
    "subcategory": {
      "en": "Italy",
      "zh": "意大利",
      "sv": "Italy"
    },
    "dish_name": {
      "en": "Mushroom Risotto",
      "zh": "蘑菇意式烩饭",
      "sv": "Risotto med skogschampinjoner"
    },
    "description": {
      "en": "A creamy Northern Italian rice dish made by slowly stirring in broth and wild mushrooms.",
      "zh": "一道浓郁的意大利北部米饭料理，做法是将肉汤和野生蘑菇慢慢搅拌加入米饭中制成。",
      "sv": "En krämig norditaliensk risrätt gjord genom att långsamt röra i buljong och vilda svampar."
    },
    "total_time_min": 45,
    "difficulty": {
      "en": "Medium",
      "zh": "中等",
      "sv": "Medel"
    },
    "servings": 4,
    "main_type": {
      "en": "Vegetable",
      "zh": "蔬菜/豆类",
      "sv": "Grönsak"
    },
    "ingredients": {
      "en": [
        "3 shallots",
        "1 clove of garlic",
        "900 ml mushroom broth (water and stock cube or stock)",
        "2 tbsp olive oil",
        "300 ml carnaroli or arborio rice",
        "200 ml white wine or cooking wine",
        "250 g chestnut mushrooms",
        "3 tbsp butter",
        "200 ml grated parmesan",
        "salt and freshly ground black pepper",
        "arugula for serving"
      ],
      "zh": [
        "3个小洋葱",
        "1瓣大蒜",
        "900毫升蘑菇汤（水加浓汤宝或高汤）",
        "2汤匙橄榄油",
        "300毫升卡纳罗利米或意大利烩饭米",
        "200毫升白葡萄酒或料酒",
        "250克栗蘑",
        "3汤匙黄油",
        "200毫升帕玛森芝士碎",
        "盐和现磨黑胡椒",
        "芝麻菜（用于装饰）"
      ],
      "sv": [
        "3 schalottenlökar",
        "1 vitlöksklyfta",
        "9 dl svampbuljong (vatten och buljongtärning eller fond)",
        "2 msk olivolja",
        "3 dl carnaroli- eller arborioris",
        "2 dl vitt vin eller matlagningsvin",
        "250 g kastanjechampinjoner",
        "3 msk smör",
        "2 dl riven parmesan",
        "salt och nymalen svartpeppar",
        "rucola till servering"
      ]
    },
    "steps": {
      "en": [
        "Peel the garlic cloves. Tear the basil leaves. Grate the cheese.",
        "Place the garlic, basil, cheese, nuts and salt in a food processor. Process until everything is finely chopped. Everything can also be finely chopped with a knife. Add the oil, a little at a time, while stirring or while the machine is running. Stir in the water. Season with black pepper and possibly more salt.",
        "Cook the pasta according to the instructions on the package and mix it with the pesto.",
        "To serve: Top the pesto pasta with a little grated Parmesan cheese."
      ],
      "zh": [
        "将蒜瓣剥皮。撕碎罗勒叶。将奶酪擦成丝。",
        "将蒜瓣、罗勒、奶酪、坚果和盐放入食品加工机中。搅打至所有食材都切碎。也可以用刀将所有食材切碎。一边搅拌或机器运转，一边少量多次地加入油。加入水并搅拌均匀。用黑胡椒调味，并可根据个人口味酌情加盐。",
        "按照包装上的说明烹煮意面，然后与青酱拌匀。",
        "食用方法：在青酱意面上撒上少许帕玛森奶酪碎。"
      ],
      "sv": [
        "Skala och finhacka löken och vitlöken. Koka upp buljongen som ska hållas varm.",
        "Fräs lök och vitlök i olivoljan i en tjockbottnad kastrull utan att det får färg. Höj värmen och tillsätt riset, fräs tills det är glansigt. Häll på vinet och låt det koka in i riset.",
        "Späd med varm buljong under omrörning. Börja med 3-4 dl och ta sedan 1 dl i taget (för 4 port) efterhand som riset suger upp buljongen. Låt det koka sakta och rör ofta. Riset är färdigkokt efter 15-20 minuter. Ta upp några riskorn och smaka. Det ska finnas en kärna som ger visst tuggmotstånd.",
        "Ansa och skiva svampen. Stek den i smöret och krydda med salt och peppar. Rör ner svampen i riset. Tillsätt den rivna parmesansosten. Risotton ska nu vara ganska lös och krämig i konsistensen. Späd ev. med mer buljong. Smaksätt med salt och peppar.",
        "Servera risotton direkt på varma tallrikar med lite rucola på toppen."
      ]
    },
    "tags": [],
    "cooking_method": {
      "en": "",
      "zh": "",
      "sv": ""
    },
    "tips": {
      "en": "Feel free to complement with a filling salad or other side dish.",
      "zh": "您可以搭配一份丰盛的沙拉或其他配菜。",
      "sv": "Komplettera gärna med en mättande sallad eller annat tillbehör."
    },
    "taste_preferences": [
      "rich",
      "mild",
      "salty"
    ],
    "image_url": "/Recipe Image/Europe/EU-IT-003.png"
  },
  {
    "id": "EU-IT-004",
    "region": {
      "en": "Europe",
      "zh": "欧洲",
      "sv": "Europa"
    },
    "subcategory": {
      "en": "Italy",
      "zh": "意大利",
      "sv": "Italy"
    },
    "dish_name": {
      "en": "Spaghetti Bolognese",
      "zh": "意大利肉酱面",
      "sv": "Spaghetti bolognese"
    },
    "description": {
      "en": "A hearty Italian-American staple featuring spaghetti tossed in a rich, slow-cooked meat sauce.",
      "zh": "一道丰盛的意式美式主食，以意大利面为主要食材，拌入浓郁的慢炖肉酱中。",
      "sv": "En rejäl italiensk-amerikansk klassiker med spaghetti blandad med en rik, långkokt köttsås."
    },
    "total_time_min": 30,
    "difficulty": {
      "en": "Medium",
      "zh": "中等",
      "sv": "Medel"
    },
    "servings": 4,
    "main_type": {
      "en": "Meat",
      "zh": "肉类",
      "sv": "Kött"
    },
    "ingredients": {
      "en": [
        "1 carrot",
        "1 yellow onion",
        "approx. 500 g minced beef or mixed minced meat",
        "1 tbsp olive oil",
        "2 tsp dried oregano",
        "1 pack crushed tomatoes with garlic (390 g each)",
        "3 dl water",
        "2 tbsp tomato paste",
        "1/2 tbsp Japanese soy sauce",
        "1 meat bouillon cube (or equivalent amount of stock)",
        "salt",
        "pepper",
        "4 servings spaghetti",
        "65 g rocket or other green salad"
      ],
      "zh": [
        "1根胡萝卜",
        "1个黄洋葱",
        "约500克牛肉末或混合肉末",
        "1汤匙橄榄油",
        "2茶匙干牛至",
        "1包蒜蓉番茄碎（每包390克）",
        "3分升水",
        "2汤匙番茄酱",
        "1/2汤匙日式酱油",
        "1块肉汤块（或等量高汤）",
        "盐",
        "胡椒粉",
        "4人份意大利面",
        "65克芝麻菜或其他绿叶蔬菜"
      ],
      "sv": [
        "1 morot",
        "1 gul lök",
        "ca 500 g nötfärs eller blandfärs",
        "1 msk olivolja",
        "2 tsk torkad oregano",
        "1 förp krossade tomater med vitlök (à 390 g)",
        "3 dl vatten",
        "2 msk tomatpuré",
        "1/2 msk japansk soja",
        "1 köttbuljongtärning (eller motsvarande mängd fond)",
        "salt",
        "peppar",
        "4 port spaghetti",
        "65 g rucola eller annan grön sallad"
      ]
    },
    "steps": {
      "en": [
        "Put a large saucepan of water on for the spaghetti.",
        "Peel and grate the carrot coarsely on a grater. Peel and chop the onion.",
        "Brown the minced meat in the olive oil in a large saucepan or frying pan with high sides. Mix in the carrot and onion and sauté for about 3 minutes.",
        "Mix in the oregano, crushed tomatoes, water, tomato paste, soy sauce and crumbled stock cube.",
        "Reduce the heat and let the sauce simmer for about 10 minutes under the lid. Season with salt and pepper.",
        "Cook the pasta according to the instructions on the package.",
        "Serve the minced meat sauce with spaghetti and arugula."
      ],
      "zh": [
        "准备一大锅水，用来煮意面。",
        "胡萝卜去皮，用擦丝器粗略擦成丝。洋葱去皮切碎。",
        "在大汤锅或深底煎锅中，用橄榄油将肉末炒至变色。加入胡萝卜丝和洋葱丝，翻炒约3分钟。",
        "加入牛至、番茄碎、水、番茄酱、酱油和捏碎的浓汤宝。",
        "转小火，盖上锅盖，慢炖约10分钟。用盐和胡椒粉调味。",
        "按照包装上的说明煮意面。",
        "将肉末酱汁与意面和芝麻菜一起享用。"
      ],
      "sv": [
        "Sätt på en stor kastrull med vatten till spaghettin.",
        "Skala och riv moroten grovt på ett rivjärn. Skala och hacka löken.",
        "Bryn färsen i olivoljan i en stor kastrull eller stekpanna med höga kanter. Blanda i morot och lök och låt fräsa ca 3 minuter.",
        "Blanda ner oregano, krossade tomater, vatten, tomatpuré, soja och smulad buljongtärning.",
        "Sänk värmen och låt såsen sjuda ca 10 minuter under lock. Smaka av med salt och peppar.",
        "Koka pastan enligt anvisningen på förpackningen.",
        "Servera köttfärssåsen med spaghetti och ruccola."
      ]
    },
    "tags": [],
    "cooking_method": {
      "en": "",
      "zh": "",
      "sv": ""
    },
    "tips": {
      "en": "Arrange the spaghetti like a pro! Insert a pair of tongs and swirl the pasta around until you get enough. Arrange on the plate.",
      "zh": "像专业人士一样摆放意大利面！用夹子夹住意大利面，轻轻翻动，直到夹到足够的量。然后摆放在盘子上。",
      "sv": "Lägg upp spaghettin som ett proffs! Stoppa ner en stekpincett och snurra runt i pastan tills du får tillräcklig mängd. Lägg upp på tallriken."
    },
    "taste_preferences": [
      "rich",
      "sour",
      "mild"
    ],
    "image_url": "/Recipe Image/Europe/EU-IT-004.png"
  },
  {
    "id": "EU-IT-005",
    "region": {
      "en": "Europe",
      "zh": "欧洲",
      "sv": "Europa"
    },
    "subcategory": {
      "en": "Italy",
      "zh": "意大利",
      "sv": "Italy"
    },
    "dish_name": {
      "en": "Lasagna",
      "zh": "千层面",
      "sv": "Lasagna"
    },
    "description": {
      "en": "A classic Italian dish of stacked pasta sheets layered with meat ragù and creamy béchamel sauce.",
      "zh": "一道经典的意大利菜，由层层叠叠的意面片，上面浇上肉酱和奶油白酱。",
      "sv": "En klassisk italiensk rätt med staplade pastaplattor varvade med köttragù och krämig béchamelsås."
    },
    "total_time_min": null,
    "difficulty": {
      "en": "Medium",
      "zh": "中等",
      "sv": "Medel"
    },
    "servings": 4,
    "main_type": {
      "en": "Meat",
      "zh": "肉类",
      "sv": "Kött"
    },
    "ingredients": {
      "en": [
        "Meat sauce",
        "2 yellow onions",
        "2 garlic cloves",
        "500 g ground beef",
        "1 tbsp oil",
        "4 tbsp tomato paste",
        "1 tsp dried thyme",
        "1 tsp dried rosemary",
        "1 pack crushed tomatoes (390 g each)",
        "1 beef stock cube",
        "salt",
        "pepper",
        "Cheese sauce",
        "6 tbsp butter (6 tbsp equals approx. 90 g)",
        "6 tbsp wheat flour",
        "10 dl milk",
        "2 dl grated parmesan",
        "9 dried lasagna sheets",
        "To serve",
        "salad"
      ],
      "zh": [
        "肉酱",
        "2 个黄洋葱",
        "2 瓣大蒜",
        "500 克牛肉末",
        "1 汤匙油",
        "4 汤匙番茄酱",
        "1 茶匙干百里香",
        "1 茶匙干迷迭香",
        "1 包碎番茄（每包 390 克）",
        "1 块牛肉浓汤宝",
        "盐",
        "胡椒粉",
        "奶酪酱",
        "6 汤匙黄油（约 90 克）",
        "6 汤匙小麦粉",
        "10 分升牛奶",
        "2 分升帕玛森芝士碎",
        "9 张干千层面皮",
        "佐餐配料",
        "沙拉"
      ],
      "sv": [
        "Köttfärssås",
        "2 gula lökar",
        "2 vitlöksklyftor",
        "500 g nötfärs",
        "1 msk olja",
        "4 msk tomatpuré",
        "1 tsk torkad timjan",
        "1 tsk torkad rosmarin",
        "1 förp krossade tomater (à 390 g)",
        "1 köttbuljongtärning",
        "salt",
        "peppar",
        "Ostsås",
        "6 msk smör (6 msk motsvarar ca 90 g)",
        "6 msk vetemjöl",
        "10 dl mjölk",
        "2 dl riven parmesan",
        "9 torkade lasagneplattor",
        "Till servering",
        "sallad"
      ]
    },
    "steps": {
      "en": [
        "Set the oven to 175°C.",
        "Minced meat sauce: Peel and chop the onion and garlic. Fry the minced meat, onion and garlic in the oil in a frying pan.",
        "Add the tomato puree and let it sizzle with the minced meat for a minute or so. Season with thyme and rosemary. Add the crushed tomatoes and stock cube and let it cook for about 10 minutes. Season with salt and pepper.",
        "Cheese sauce: Melt the butter and whisk in the flour. Pour in a little of the milk at a time while whisking. Bring to the boil and let the sauce cook for about 5 minutes, stirring occasionally. Stir in the Parmesan cheese and season with salt and pepper.",
        "Pour some cheese sauce into the bottom of an ovenproof dish (approx. 20 x 30 cm). Place a layer of lasagna sheets on top and then a layer of minced meat sauce. Repeat the steps and finish with a layer of cheese sauce.",
        "Place the lasagna in the middle of the oven for about 40 minutes (or the time according to the packaging on the lasagna sheets.)",
        "To serve: Serve the lasagna with a simple salad."
      ],
      "zh": [
        "将烤箱预热至175°C。",
        "肉末酱：将洋葱和大蒜去皮切碎。在煎锅中用油将肉末、洋葱和大蒜炒香。",
        "加入番茄泥，与肉末一起翻炒约一分钟。加入百里香和迷迭香调味。加入番茄碎和浓汤宝，煮约10分钟。用盐和胡椒粉调味。",
        "奶酪酱：融化黄油，拌入面粉。一边搅拌一边少量多次地倒入牛奶。煮沸后，小火慢煮约5分钟，偶尔搅拌。拌入帕玛森奶酪，并用盐和胡椒粉调味。",
        "在烤盘（约20 x 30厘米）底部倒入一些奶酪酱。铺上一层千层面皮，再铺上一层肉末酱。重复以上步骤，最后再铺上一层奶酪酱。",
        "将千层面放入烤箱中层，烤约 40 分钟（或根据千层面皮包装上的说明烤制）。",
        "食用方法：将千层面搭配一份简单的沙拉一起享用。"
      ],
      "sv": [
        "Sätt ugnen på 175°C.",
        "Köttfärssås: Skala och hacka lök och vitlök. Fräs färs, lök och vitlök i oljan i en stekpanna.",
        "Tillsätt tomatpuré som får fräsa med i färsen någon minut. Krydda med timjan och rosmarin. Tillsätt krossade tomater och buljongtärning låt det koka ca 10 minuter. Smaka av med salt och peppar.",
        "Ostsås: Smält smöret och vispa ner mjölet. Häll i lite av mjölken i taget under vispning. Koka upp och låt såsen koka ca 5 minuter, rör då och då. Rör ner parmesanosten och smaka av med salt och peppar.",
        "Häll lite ostsås i botten på en ugnssäker form (ca 20 x 30 cm). Lägg på ett lager lasagneplattor och sen ett lager köttfärssås. Upprepa stegen och avsluta med ett lager ostsås.",
        "Sätt in lasagnen mitt i ugnen ca 40 minuter (eller tiden enligt förpackningen på lasagneplattorna.)",
        "Till servering: Servera lasagnen med en enkel sallad."
      ]
    },
    "tags": [],
    "cooking_method": {
      "en": "",
      "zh": "",
      "sv": ""
    },
    "taste_preferences": [
      "rich",
      "salty"
    ],
    "image_url": "/Recipe Image/Europe/EU-IT-005.png"
  },
  {
    "id": "EU-IT-006",
    "region": {
      "en": "Europe",
      "zh": "欧洲",
      "sv": "Europa"
    },
    "subcategory": {
      "en": "Italy",
      "zh": "意大利",
      "sv": "Italy"
    },
    "dish_name": {
      "en": "Pesto Pasta",
      "zh": "罗勒青酱面",
      "sv": "Pesto Pasta"
    },
    "description": {
      "en": "An Italian pasta dish dressed with bright green pesto, traditionally made from basil, pine nuts, and Parmesan.",
      "zh": "一道意大利面食，淋上鲜亮的绿色香蒜酱，传统上由罗勒、松子和帕玛森干酪制成。",
      "sv": "En italiensk pastarätt klädd med ljusgrön pesto, traditionellt gjord på basilika, pinjenötter och parmesanost."
    },
    "total_time_min": 30,
    "difficulty": {
      "en": "Easy",
      "zh": "简单",
      "sv": "Lätt"
    },
    "servings": 4,
    "main_type": {
      "en": "Vegetable",
      "zh": "蔬菜/豆类",
      "sv": "Grönsak"
    },
    "ingredients": {
      "en": [
        "1 - 2 cloves of garlic",
        "1 pot of basil",
        "1 dl freshly grated Parmesan or other aged hard cheese",
        "3/4 dl walnuts, pine nuts or sunflower seeds",
        "1 pinch salt",
        "1 dl olive oil, sunflower oil or rapeseed oil",
        "1 - 2 tbsp water",
        "black pepper",
        "300 g spaghetti or spaghettini"
      ],
      "zh": [
        "1-2瓣大蒜",
        "1罐罗勒",
        "1分升新鲜磨碎的帕玛森奶酪或其他陈年硬质奶酪",
        "3/4分升核桃、松子或葵花籽",
        "少许盐",
        "1分升橄榄油、葵花籽油或菜籽油",
        "1-2汤匙水",
        "黑胡椒",
        "300克意大利面或细意大利面"
      ],
      "sv": [
        "1 - 2 vitlöksklyftor",
        "1 kruka basilika",
        "1 dl färskriven parmesan eller annan lagrad hårdost",
        "3/4 dl valnötter, pinjenötter eller solrosfrön",
        "1 krm salt",
        "1 dl olivolja, solrosolja eller rapsolja",
        "1 - 2 msk vatten",
        "svartpeppar",
        "300 g spaghetti eller bandspagetti"
      ]
    },
    "steps": {
      "en": [
        "Peel the garlic cloves. Tear the basil leaves. Grate the cheese.",
        "Place the garlic, basil, cheese, nuts and salt in a food processor. Process until everything is finely chopped. Everything can also be finely chopped with a knife. Add the oil, a little at a time, while stirring or while the machine is running. Stir in the water. Season with black pepper and possibly more salt.",
        "Cook the pasta according to the instructions on the package and mix it with the pesto.",
        "To serve: Top the pesto pasta with a little grated Parmesan cheese."
      ],
      "zh": [
        "将蒜瓣剥皮。撕碎罗勒叶。将奶酪擦成丝。",
        "将蒜瓣、罗勒、奶酪、坚果和盐放入食品加工机中。搅打至所有食材都切碎。也可以用刀将所有食材切碎。一边搅拌或机器运转，一边少量多次地加入油。加入水并搅拌均匀。用黑胡椒调味，并可根据个人口味酌情加盐。",
        "按照包装上的说明烹煮意面，然后与青酱拌匀。",
        "食用方法：在青酱意面上撒上少许帕玛森奶酪碎。"
      ],
      "sv": [
        "Skala vitlöksklyftorna. Repa bladen från basilikan. Riv osten.",
        "Lägg vitlök, basilika, ost, nötter och salt i en matberedare. Kör tills allt är finfördelat. Allt kan också hackas fint med kniv. Tillsätt oljan, lite i taget, under omrörning eller medan maskinen är på. Rör i vattnet. Smaka av med svartpeppar och eventuellt mer salt.",
        "Koka pastan enligt anvisning på förpackningen och blanda den med peston.",
        "Till servering: Toppa gärna pesto pastan med lite riven parmesanost."
      ]
    },
    "tags": [],
    "cooking_method": {
      "en": "",
      "zh": "",
      "sv": ""
    },
    "tips": {
      "en": "Pesto is good with pasta, fried or grilled fish and meat, and with salads, such as potato salad.",
      "zh": "青酱适合搭配意大利面、煎鱼或烤鱼、烤肉，以及沙拉，例如土豆沙拉。",
      "sv": "Pesto är gott till pasta, till stekt eller grillad fisk och kött, till sallad t ex potatissallad."
    },
    "taste_preferences": [
      "rich",
      "mild",
      "salty"
    ],
    "image_url": "/Recipe Image/Europe/EU-IT-006.png"
  },
  {
    "id": "EU-SP-001",
    "region": {
      "en": "Europe",
      "zh": "欧洲",
      "sv": "Europa"
    },
    "subcategory": {
      "en": "Spain",
      "zh": "西班牙",
      "sv": "Spain"
    },
    "dish_name": {
      "en": "Paella with seafood",
      "zh": "西班牙海鲜饭",
      "sv": "Paella med skaldjur"
    },
    "description": {
      "en": "Spain's famous saffron-infused rice dish traditionally cooked in a wide, shallow pan.",
      "zh": "西班牙著名的藏红花米饭，传统上是用宽而浅的平底锅烹制的。",
      "sv": "Spaniens berömda saffransinfuserade risrätt som traditionellt tillagas i en vid, grund panna."
    },
    "total_time_min": null,
    "difficulty": {
      "en": "Medium",
      "zh": "中等",
      "sv": "Medel"
    },
    "servings": 4,
    "main_type": {
      "en": "Seafood",
      "zh": "海鲜",
      "sv": "Skaldjur"
    },
    "ingredients": {
      "en": [
        "350 g mixed seafood",
        "1 yellow onion (peeled and chopped)",
        "1 tbsp olive oil",
        "3 dl arborio rice",
        "1/2 g saffron",
        "1 dl white cooking wine or white wine",
        "8 - 9 dl water",
        "1 1/2 tbsp seafood stock",
        "1 red bell pepper",
        "70 g fresh spinach",
        "salt",
        "pepper"
      ],
      "zh": [
        "350克混合海鲜",
        "1个黄洋葱（去皮切碎）",
        "1汤匙橄榄油",
        "3分升意大利米",
        "0.5克藏红花",
        "1分升白料酒或白葡萄酒",
        "8-9分升水",
        "1.5汤匙海鲜高汤",
        "1个红甜椒",
        "70克新鲜菠菜",
        "盐",
        "胡椒粉"
      ],
      "sv": [
        "350 g skaldjursmix",
        "1 gul lök (skalad och hackad)",
        "1 msk olivolja",
        "3 dl arborioris",
        "1/2 g saffran",
        "1 dl vitt matlagningsvin eller vitt vin",
        "8 - 9 dl vatten",
        "1 1/2 msk skaldjursfond",
        "1 röd paprika",
        "70 g färsk bladspenat",
        "salt",
        "peppar"
      ]
    },
    "steps": {
      "en": [
        "Thaw the seafood mix according to the package instructions. Drain well.",
        "Sauté the onion and garlic in the oil. Add the rice, saffron and wine, let it cook for a minute. Pour in water so that it covers the rice by a few cm and stir in the stock. Dilute with more water as it boils. Cook slowly for about 20 minutes.",
        "Split, core and cut the peppers into strips. Add the peppers, spinach and seafood mix when there are a few minutes left in the cooking time. Serve the paella with bread and lemon wedges."
      ],
      "zh": [
        "按照包装说明解冻海鲜混合物，沥干水分。",
        "用油炒香洋葱和大蒜。加入大米、藏红花和葡萄酒，翻炒一分钟。倒入水，水量没过大米几厘米，然后倒入高汤。煮沸后，根据需要加水稀释。慢炖约20分钟。",
        "将甜椒切开、去籽，切成条状。在烹饪时间即将结束时，加入甜椒、菠菜和海鲜混合物。将海鲜饭配面包和柠檬角一起享用。"
      ],
      "sv": [
        "Tina skaldjursmixen enligt förpackningens anvisning. Låt den rinna av väl.",
        "Fräs lök och vitlök i oljan. Tillsätt ris, saffran och vin, låt det koka någon minut. Häll på vatten så att det täcker någon cm över riset och rör ner fonden. Späd med mera vatten vartefter det kokar in. Koka sakta ca 20 minuter.",
        "Dela, kärna ur och skär paprikan i strimlor. Tillsätt paprika, spenat och skaldjursmixen när det återstår någon minut av tillagningstiden. Servera paellan med bröd och citronklyftor."
      ]
    },
    "tags": [],
    "cooking_method": {
      "en": "",
      "zh": "",
      "sv": ""
    },
    "taste_preferences": [
      "salty",
      "mild",
      "rich"
    ],
    "image_url": "/Recipe Image/Europe/EU-SP-001.png"
  },
  {
    "id": "EU-SP-002",
    "region": {
      "en": "Europe",
      "zh": "欧洲",
      "sv": "Europa"
    },
    "subcategory": {
      "en": "Spain",
      "zh": "西班牙",
      "sv": "Spain"
    },
    "dish_name": {
      "en": "Caldereta",
      "zh": "西班牙炖肉",
      "sv": "Caldereta"
    },
    "description": {
      "en": "A Spanish/Filipino beef stew braised in tomato sauce and often seasoned with olives and chili.",
      "zh": "一道西班牙/菲律宾风味的炖牛肉，用番茄酱炖煮，通常用橄榄和辣椒调味。",
      "sv": "En spansk/filippinsk nötköttsgryta bräserad i tomatsås och ofta kryddad med oliver och chili."
    },
    "total_time_min": null,
    "difficulty": {
      "en": "Medium",
      "zh": "中等",
      "sv": "Medel"
    },
    "servings": 4,
    "main_type": {
      "en": "Meat",
      "zh": "肉类",
      "sv": "Kött"
    },
    "ingredients": {
      "en": [
        "2 lbs beef cubed",
        "3 pieces garlic cloves crushed and chopped",
        "1 piece onion finely chopped",
        "2 cups beef broth",
        "1 piece red bell pepper sliced",
        "1 piece green bell pepper sliced",
        "1 cup tomato sauce",
        "½ cup liver spread processed using blender",
        "1 teaspoon chili flakes",
        "3 pieces dried bay leaves",
        "2 cups potatoes sliced",
        "2 cups carrots sliced",
        "1/4 cup cooking oil",
        "⅔ cup green olives",
        "salt and pepper to taste"
      ],
      "zh": [
        "2磅牛肉丁",
        "3瓣蒜，压碎切碎",
        "1个洋葱，切碎",
        "2杯牛肉汤",
        "1个红甜椒，切片",
        "1个青甜椒，切片",
        "1杯番茄酱",
        "½杯肝酱，用搅拌机搅碎",
        "1茶匙辣椒碎",
        "3片干月桂叶",
        "2杯土豆片",
        "2杯胡萝卜片",
        "¼杯食用油",
        "⅔杯青橄榄",
        "盐和胡椒粉适量"
      ],
      "sv": [
        "900 g nötkött i tärningar",
        "3 vitlöksklyftor krossade och hackade",
        "1 finhackad lök",
        "5 dl nötbuljong",
        "1 röd paprika i skivor",
        "1 grön paprika i skivor",
        "2,5 dl tomatsås",
        "½ dl leverpålägg mixat med mixer",
        "1 tsk chiliflingor",
        "3 torkade lagerblad",
        "5 dl potatis i skivor",
        "5 dl morötter i skivor",
        "0,6 dl matolja",
        "⅔ dl gröna oliver",
        "salt och peppar efter smak"
      ]
    },
    "steps": {
      "en": [
        "Heat the cooking oil in the cooking pot or pressure cooker.",
        "Sauté the onion and garlic.",
        "Add the beef. Cook for 5 minutes or until the color turns light brown.",
        "Add the dried bay leaves and chili flakes or crushed pepper. Stir.",
        "Add the liver spread. Stir.",
        "Pour-in the tomato sauce and beef broth.",
        "Cook the beef until it becomes tender (about 30 mins if using a pressure cooker, or 1 to 2 hours if using an ordinary pot).",
        "Add potato and carrots. Cook for 8 to 10 minutes.",
        "Put the green olives and bell peppers in the cooking pot. Stir and continue to cook for 5 minutes more.",
        "Add salt and pepper to taste",
        "Serve Hot. Enjoy!"
      ],
      "zh": [
        "在锅或高压锅中加热食用油。",
        "爆香洋葱和大蒜。",
        "加入牛肉。翻炒5分钟或直至牛肉呈浅棕色。",
        "加入干月桂叶和辣椒碎或辣椒片。翻炒。",
        "加入肝酱。翻炒。",
        "倒入番茄酱和牛肉汤。",
        "将牛肉煮至软烂（如果使用高压锅，大约需要30分钟；如果使用普通锅，则需要1至2小时）。",
        "加入土豆和胡萝卜。煮8至10分钟。",
        "将青橄榄和甜椒放入锅中。翻炒，继续煮5分钟。",
        "根据口味加入盐和胡椒粉。",
        "趁热享用！"
      ],
      "sv": [
        "Värm matoljan i en gryta eller tryckkokare.",
        "Fräs lök och vitlök.",
        "Tillsätt köttet. Stek i 5 minuter eller tills det blir ljusbrunt.",
        "Tillsätt torkade lagerblad och chiliflingor eller krossad paprika. Rör om.",
        "Tillsätt leverpålägget. Rör om.",
        "Häll i tomatsåsen och köttbuljongen.",
        "Koka köttet tills det är mört (cirka 30 minuter om du använder en tryckkokare, eller 1 till 2 timmar om du använder en vanlig gryta).",
        "Tillsätt potatis och morötter. Koka i 8 till 10 minuter.",
        "Lägg de gröna oliverna och paprikorna i grytan. Rör om och fortsätt att koka i ytterligare 5 minuter.",
        "Salta och peppra efter smak.",
        "Servera varmt. Smaklig måltid!"
      ]
    },
    "tags": [],
    "cooking_method": {
      "en": "",
      "zh": "",
      "sv": ""
    },
    "taste_preferences": [
      "rich",
      "salty"
    ],
    "image_url": "/Recipe Image/Europe/EU-SP-002.png"
  },
  {
    "id": "EU-SP-003",
    "region": {
      "en": "Europe",
      "zh": "欧洲",
      "sv": "Europa"
    },
    "subcategory": {
      "en": "Spain",
      "zh": "西班牙",
      "sv": "Spain"
    },
    "dish_name": {
      "en": "Spanish Shrimp Pasta",
      "zh": "西班牙风味虾仁意面",
      "sv": "Spansk räkpasta"
    },
    "description": {
      "en": "Pasta tossed with shrimp and Spanish flavors like garlic, chili, and paprika.",
      "zh": "意面拌虾仁，并加入大蒜、辣椒和红辣椒粉等西班牙风味调料。",
      "sv": "Pasta blandad med räkor och spanska smaker som vitlök, chili och paprika."
    },
    "total_time_min": 30,
    "difficulty": {
      "en": "Medium",
      "zh": "中等",
      "sv": "Medel"
    },
    "servings": 4,
    "main_type": {
      "en": "Seafood",
      "zh": "海鲜",
      "sv": "Skaldjur"
    },
    "ingredients": {
      "en": [
        "4 servings of fusilli pasta",
        "1 clove of garlic",
        "1/2 leek",
        "2 tbsp olive oil",
        "1 packet of saffron (1/2 g each)",
        "1 tsp dried oregano",
        "2 dl cooking cream",
        "salt",
        "pepper",
        "200 g frozen, peeled shrimp",
        "2 tbsp chopped parsley",
        "250 g cherry tomatoes",
        "65 g fresh spinach"
      ],
      "zh": [
        "4人份螺旋面",
        "1瓣蒜",
        "半根葱",
        "2汤匙橄榄油",
        "1包藏红花（每包0.5克）",
        "1茶匙干牛至",
        "2分升烹饪奶油",
        "盐",
        "胡椒粉",
        "200克冷冻去壳虾仁",
        "2汤匙切碎的欧芹",
        "250克圣女果",
        "65克新鲜菠菜"
      ],
      "sv": [
        "4 port pasta fusilli/skruvmakaroner",
        "1 vitlöksklyfta",
        "1/2 purjolök",
        "2 msk olivolja",
        "1 paket saffran (à 1/2 g)",
        "1 tsk torkad oregano",
        "2 dl matlagningsgrädde",
        "salt",
        "peppar",
        "200 g frysta, skalade räkor",
        "2 msk hackad persilja",
        "250 g körsbärstomater",
        "65 g färsk spenat"
      ]
    },
    "steps": {
      "en": [
        "Cook the pasta according to the instructions on the package.",
        "Peel and chop the garlic and trim and shred the leek.",
        "Heat the olive oil in a frying pan. Add the garlic and leek, sauté for a minute without browning. Add the saffron and oregano, sauté for another minute.",
        "Pour in the cream and season with salt and pepper. Cook for a few minutes. Turn off the heat and add the frozen shrimp and parsley. Let the shrimp warm up.",
        "Divide the tomatoes. Mix the tomatoes, spinach and the drained pasta with the shrimp sauce."
      ],
      "zh": [
        "按照包装上的说明煮意面。",
        "剥去大蒜皮，切碎；将葱去蒂切丝。",
        "在煎锅中加热橄榄油。加入大蒜和葱，翻炒一分钟，不要炒至焦黄。加入藏红花和牛至，再翻炒一分钟。",
        "倒入奶油，并用盐和胡椒调味。煮几分钟。关火，加入冷冻虾仁和欧芹。让虾仁回温。",
        "将番茄分成几份。将番茄、菠菜和沥干水分的意面与虾酱混合。"
      ],
      "sv": [
        "Koka pastan enligt anvisningen på förpackningen.",
        "Skala och hacka vitlök samt ansa och strimla purjolöken.",
        "Värm olivoljan i en stekpanna. Lägg i vitlök och purjolök, låt fräsa någon minut utan att det tar färg. Tillsätt saffran och oregano, låt fräsa med någon minut.",
        "Häll på grädden och krydda med salt och peppar. Koka ihop några minuter. Stäng av plattan och vänd ner de frysta räkorna och persiljan. Låt räkorna bli varma.",
        "Dela tomaterna. Blanda tomater, spenat och den avhällda pastan med räksåsen."
      ]
    },
    "tags": [],
    "cooking_method": {
      "en": "",
      "zh": "",
      "sv": ""
    },
    "taste_preferences": [
      "mild",
      "salty"
    ],
    "image_url": "/Recipe Image/Europe/EU-SP-003.png"
  },
  {
    "id": "EU-SP-004",
    "region": {
      "en": "Europe",
      "zh": "欧洲",
      "sv": "Europa"
    },
    "subcategory": {
      "en": "Spain",
      "zh": "西班牙",
      "sv": "Spain"
    },
    "dish_name": {
      "en": "Spanish tortilla",
      "zh": "西班牙土豆饼",
      "sv": "Spansk tortilla"
    },
    "description": {
      "en": "Spain's national dish: a thick, simple omelette made with slow-cooked potatoes and onions.",
      "zh": "西班牙的国菜：一种用慢炖土豆和洋葱制成的厚厚的、简单的煎蛋卷。",
      "sv": "Spaniens nationalrätt: en tjock, enkel omelett gjord på långkokt potatis och lök."
    },
    "total_time_min": 83,
    "difficulty": {
      "en": "Medium",
      "zh": "中等",
      "sv": "Medel"
    },
    "servings": 1,
    "main_type": {
      "en": "Meat",
      "zh": "肉类",
      "sv": "Kött"
    },
    "ingredients": {
      "en": [
        "300 g beef",
        "1 pc onion",
        "2 cloves garlic",
        "30 ml olive oil"
      ],
      "zh": [
        "300 g 牛肉",
        "1 个 洋葱",
        "2 cloves 大蒜",
        "30 毫升 橄榄油"
      ],
      "sv": [
        "300 g nötkött",
        "1 pc lök",
        "2 cloves vitlök",
        "30 ml olivolja"
      ]
    },
    "steps": {
      "en": [
        "Prepare ingredients: 300 g beef, 1 pc onion, 2 cloves garlic, 30 ml olive oil.",
        "If required, marinate or season the main ingredients for 15–30 minutes.",
        "Preheat pan or oven to 200°C when appropriate.",
        "Cook Patatas Bravas using the suitable method (grill, sauté, simmer or bake) until properly done.",
        "Taste and adjust seasoning, rest if needed, then serve warm."
      ],
      "zh": [
        "准备食材：300克牛肉、1个洋葱、2瓣大蒜、30毫升橄榄油。",
        "如有需要，将主要食材腌制或调味15-30分钟。",
        "如有需要，将平底锅或烤箱预热至200°C。",
        "使用合适的烹饪方法（烧烤、煎炒、炖煮或烘烤）烹制西班牙辣味土豆，直至完全熟透。",
        "尝尝味道，调整调味料，如有需要可静置片刻，然后趁热享用。"
      ],
      "sv": [
        "Förbered ingredienserna: 300 g beef, 1 pc onion, 2 cloves garlic, 30 ml olive oil.",
        "Om nödvändigt, marinera eller krydda huvudingredienserna i 15–30 minuter.",
        "Förvärm panna eller ugn till 200°C vid behov.",
        "Tillaga Patatas Bravas using the suitable method (grill, sauté, simmer or bake) until properly done.",
        "Smaka av och justera kryddning, vila om nödvändigt och servera varm."
      ]
    },
    "tags": [],
    "cooking_method": {
      "en": "",
      "zh": "",
      "sv": ""
    },
    "taste_preferences": [
      "mild",
      "salty"
    ],
    "image_url": "/Recipe Image/Europe/EU-SP-004.png"
  },
  {
    "id": "EU-SP-005",
    "region": {
      "en": "Europe",
      "zh": "欧洲",
      "sv": "Europa"
    },
    "subcategory": {
      "en": "Spain",
      "zh": "西班牙",
      "sv": "Spain"
    },
    "dish_name": {
      "en": "Roast lamb with rosemary",
      "zh": "迷迭香烤羊肉",
      "sv": "Lammstek med rosmarin"
    },
    "description": {
      "en": "A Mediterranean holiday staple, the lamb is slow-roasted until tender and infused with rosemary and garlic.",
      "zh": "这道菜是地中海地区节日的必备佳肴，羊肉慢烤至软嫩，并融入了迷迭香和大蒜的香味。",
      "sv": "Lamm, en klassisk medelhavsrätt, steks långsamt tills det är mört och smaksätts med rosmarin och vitlök."
    },
    "total_time_min": null,
    "difficulty": {
      "en": "Medium",
      "zh": "中等",
      "sv": "Medel"
    },
    "servings": null,
    "main_type": {
      "en": "Meat",
      "zh": "肉类",
      "sv": "Kött"
    },
    "ingredients": {
      "en": [
        "4 garlic cloves",
        "4 sprigs of sage",
        "3 sprigs of rosemary",
        "1 boneless lamb roast (approx. 1 kg)",
        "2 tbsp rapeseed oil",
        "flaked salt",
        "black pepper",
        "salt",
        "olive oil"
      ],
      "zh": [
        "4瓣大蒜",
        "4枝鼠尾草",
        "3枝迷迭香",
        "1块去骨羊肉（约1公斤）",
        "2汤匙菜籽油",
        "片状盐",
        "黑胡椒",
        "盐",
        "橄榄油"
      ],
      "sv": [
        "4 vitlöksklyftor",
        "4 kvistar salvia",
        "3 kvistar rosmarin",
        "1 urbenad lammstek (à ca 1 kg)",
        "2 msk rapsolja",
        "flingsalt",
        "svartpeppar",
        "salt",
        "olivolja"
      ]
    },
    "steps": {
      "en": [
        "Preheat the oven to 150°C.",
        "Peel the garlic cloves and chop coarsely. Pick the herbs and chop coarsely. Mix the garlic with the herbs, 2 tsp salt and ½ tsp pepper (for 4-6 servings).",
        "Remove the net from the lamb roast and unfold the roast. Massage the herb and spice mixture into the inside of the lamb roast and fold it up. Tie it together with cooking twine.",
        "Season the outside of the roast with ½ tsp salt and 2 tsp pepper (for 4-6 servings) all around. Brown the roast in rapeseed oil in a frying pan until nicely browned all around. Place the roast on an oven rack with a baking sheet underneath. Place in the middle of the oven for about 1 hour or until the internal temperature is 63°C.",
        "Remove the roast and cover with foil and let rest for about 10 minutes. Remove the twine and slice. Place on a plate and drizzle with olive oil and sprinkle with flaked salt."
      ],
      "zh": [
        "将烤箱预热至150°C。",
        "剥去蒜瓣皮，粗切。摘取香草，粗切。将蒜瓣、香草、2茶匙盐和½茶匙胡椒粉混合（4-6人份）。",
        "取下羊肉烤肉上的网袋，展开烤肉。将香草和香料混合物按摩到羊肉内部，然后折叠起来。用烹饪绳捆扎。",
        "在烤肉表面均匀撒上½茶匙盐和2茶匙胡椒粉（4-6人份）。在煎锅中用菜籽油将烤肉煎至表面金黄。将烤肉放在烤架上，烤架下方垫上烤盘。放入烤箱中层烤约1小时，或直至内部温度达到63°C。",
        "取出烤肉，用锡纸盖住，静置约10分钟。解开绳子，切片享用。放在盘子上，淋上橄榄油，撒上片状海盐。"
      ],
      "sv": [
        "Sätt ugnen på 150°C.",
        "Skala vitlöksklyftorna och hacka grovt. Plocka örterna och hacka grovt. Blanda vitlöken med örterna, 2 tsk flingsalt och ½ tsk peppar (för 4-6 port).",
        "Ta bort nätet från lammsteken och vik ut steken. Massera in ört- och kryddblandningen på lammstekens insida och vik ihop den. Bind ihop med steksnöre.",
        "Krydda utsidan av steken med ½ tsk salt och 2 krm peppar (för 4-6 port) runt om. Bryn steken i rapsolja i en stekpanna tills den får fin färg runt om. Lägg steken på ett ugnsgaller med en plåt under. Ställ in i mitten av ugnen ca 1 timme eller tills innertemperaturen är 63°C.",
        "Ta ut steken och täck med folie och låt vila ca 10 minuter. Ta bort snöret och skiva upp. Lägg på ett fat och ringla över olivolja och strö över flingsalt."
      ]
    },
    "tags": [],
    "cooking_method": {
      "en": "",
      "zh": "",
      "sv": ""
    },
    "tips": {
      "en": "Boil the remaining broth and squeeze in 1–2 tablespoons of lemon juice (for 4–6 servings). Serve with the lamb roast.",
      "zh": "将剩余的肉汤煮沸，挤入1-2汤匙柠檬汁（4-6人份）。与烤羊肉一起食用。",
      "sv": "Koka upp skyn som blir över och pressa ner 1–2 msk citronjuice (för 4-6 port). Servera till lammsteken."
    },
    "taste_preferences": [
      "rich",
      "salty"
    ],
    "image_url": "/Recipe Image/Europe/EU-SP-005.png"
  },
  {
    "id": "EU-SP-006",
    "region": {
      "en": "Europe",
      "zh": "欧洲",
      "sv": "Europa"
    },
    "subcategory": {
      "en": "Spain",
      "zh": "西班牙",
      "sv": "Spain"
    },
    "dish_name": {
      "en": "Chickpea stew with chorizo ​​and air-dried ham",
      "zh": "鹰嘴豆炖菜配西班牙辣香肠和风干火腿",
      "sv": "Kikärtsgryta med chorizo och lufttorkad skinka"
    },
    "description": {
      "en": "This is a hearty Spanish stew featuring chickpeas and potatoes, richly flavored by the smoky, spicy notes of chorizo and the salty complexity of air-dried ham.",
      "zh": "这是一道丰盛的西班牙炖菜，以鹰嘴豆和土豆为主要食材，并带有西班牙辣香肠的烟熏辛辣味和风干火腿的咸香复杂风味。",
      "sv": "Detta är en rejäl spansk gryta med kikärter och potatis, rikt smaksatt av chorizoens rökiga, kryddiga toner och den salta komplexiteten hos lufttorkad skinka."
    },
    "total_time_min": null,
    "difficulty": {
      "en": "Medium",
      "zh": "中等",
      "sv": "Medel"
    },
    "servings": null,
    "main_type": {
      "en": "Meat",
      "zh": "肉类",
      "sv": "Kött"
    },
    "ingredients": {
      "en": [
        "1 silver onion",
        "3 garlic cloves",
        "1 green pepper",
        "1 red pepper (chili)",
        "4 tomatoes (4 tomatoes equal about 500 g)",
        "4 fresh chorizo ​​sausages",
        "80 g diced air-dried ham (preferably jamón ibérico)",
        "1 packet saffron (1/2 g each)",
        "1 tbsp smoked paprika powder or pimentón",
        "1 tbsp cumin",
        "2 sprigs thyme",
        "2 sprigs rosemary",
        "4 bay leaves",
        "2 dl white wine",
        "1 tbsp concentrated chicken stock",
        "1 1/2 dl water",
        "2 packs cooked chickpeas (380 g each)",
        "olive oil",
        "1 dl chopped parsley",
        "salt",
        "black pepper"
      ],
      "zh": [
        "1 个银洋葱",
        "3 瓣大蒜",
        "1 个青椒",
        "1 个红椒（辣椒）",
        "4 个番茄（约 500 克）",
        "4 根新鲜西班牙辣香肠",
        "80 克风干火腿丁（最好是伊比利亚火腿）",
        "1 包藏红花（每包 0.5 克）",
        "1 汤匙烟熏辣椒粉或西班牙红椒粉",
        "1 汤匙孜然",
        "2 枝百里香",
        "2 枝迷迭香",
        "4 片月桂叶",
        "2 分升白葡萄酒",
        "1 汤匙浓缩鸡汤",
        "1.5 分升水",
        "2 包煮熟的鹰嘴豆（每包 380 克）",
        "橄榄油",
        "1 分升切碎的欧芹",
        "盐",
        "黑胡椒"
      ],
      "sv": [
        "1 silverlök",
        "3 vitlöksklyftor",
        "1 grön paprika",
        "1 röd peppar (chili)",
        "4 tomater (4 tomater motsvarar ca 500 g)",
        "4 färska chorizokorvar",
        "80 g tärnad luftorkad skinka (gärna jamón ibérico)",
        "1 paket saffran (à 1/2 g)",
        "1 msk rökt paprikapulver eller pimentón",
        "1 msk spiskummin",
        "2 kvistar timjan",
        "2 kvistar rosmarin",
        "4 lagerblad",
        "2 dl vitt vin",
        "1 msk konc kycklingfond",
        "1 1/2 dl vatten",
        "2 förp kokta kikärtor (à 380 g)",
        "olivolja",
        "1 dl hackad persilja",
        "salt",
        "svartpeppar"
      ]
    },
    "steps": {
      "en": [
        "Peel and finely chop the onion and garlic. Divide, core and dice the bell pepper finely. Core and chop the chilli. Grate the tomatoes coarsely and place in a fine-mesh sieve to drain the liquid.",
        "Divide the chorizo ​​in half and brown in 1 tbsp oil (for 4-6 servings) in a frying pan until it gets a little colour. Lift out and place on a plate. Brown the ham in the same frying pan. Lift out and place on a plate.",
        "Add 2 tbsp oil (for 4-6 servings) and the pepper to the same pan and fry over low heat for about 10 minutes. Add the silver onion and fry for another 10 minutes, adding more oil if necessary.",
        "Add the garlic, chilli and tomato. Stir in the saffron, paprika and cumin as well as thyme, rosemary and bay leaves. Add the chorizo ​​and ham to the pot and bring to the boil and add the wine. Cook for about 10 minutes over low heat.",
        "Add stock and water, let cook for another 15 minutes. Drain and rinse the chickpeas. Add to the pot and season with salt and pepper. Remove the bay leaves, rosemary and thyme sprigs. Drizzle with a little oil and top with parsley."
      ],
      "zh": [
        "将洋葱和大蒜去皮切碎。将甜椒去籽切丁。将辣椒去籽切碎。将番茄粗略擦碎，放入细网筛中沥干水分。",
        "将西班牙香肠切成两半，在煎锅中用1汤匙油（4-6人份）煎至略微上色。取出放在盘子里。用同一个煎锅煎火腿至上色。取出放在盘子里。",
        "在同一个煎锅中加入2汤匙油（4-6人份）和甜椒丁，小火慢煎约10分钟。加入银洋葱，继续煎10分钟，必要时可再加一些油。",
        "加入大蒜、辣椒和番茄丁。拌入藏红花、辣椒粉、孜然、百里香、迷迭香和月桂叶。将西班牙辣香肠和火腿放入锅中，煮沸后倒入葡萄酒。小火慢煮约10分钟。",
        "加入高汤和水，继续煮15分钟。沥干并冲洗鹰嘴豆。将鹰嘴豆放入锅中，用盐和胡椒调味。取出香叶、迷迭香和百里香。淋上少许橄榄油，撒上欧芹碎即可。"
      ],
      "sv": [
        "Skala och finhacka lök och vitlök. Dela, kärna ur och tärna paprikan fint. Kärna ur och hacka chilin. Riv tomaterna grovt på ett rivjärn och lägg i en finmaskig sil så vätskan rinner av.",
        "Dela chorizon på hälften och bryn i 1 msk olja (för 4-6 port) i en stekpanna tills den får lite färg. Lyft upp och lägg på en tallrik. Bryn skinkan i samma stekpanna. Lyft upp och lägg på tallriken.",
        "Tillsätt 2 msk olja (för 4-6 port) och paprikan i samma panna och stek på låg värme ca 10 minuter. Tillsätt silverlöken och bryn ytterligare 10 minuter, tillsätt ev mer olja.",
        "Tillsätt vitlök, chili och tomat. Rör i saffran, paprikapulver och spiskummin samt timjan, rosmarin och lagerblad. Tillsätt chorizo och skinka i grytan och låt koka upp och tillsätt vinet. Koka ca 10 minuter på svag värme.",
        "Tillsätt fond och vatten, låt koka ytterligare ca 15 minuter. Häll av och skölj kikärtorna. Tillsätt i grytan och smaka av med salt och peppar. Lyft upp lagerbladen, rosmarin- och timjankvistarna. Ringla över lite olja och toppa med persilja."
      ]
    },
    "tags": [],
    "cooking_method": {
      "en": "",
      "zh": "",
      "sv": ""
    },
    "taste_preferences": [
      "rich",
      "salty",
      "spicy"
    ],
    "image_url": "/Recipe Image/Europe/EU-SP-006.png"
  },
  {
    "id": "EU-SP-007",
    "region": {
      "en": "Europe",
      "zh": "欧洲",
      "sv": "Europa"
    },
    "subcategory": {
      "en": "Spain",
      "zh": "西班牙",
      "sv": "Spain"
    },
    "dish_name": {
      "en": "Almond soup with rainbow trout roe and dill",
      "zh": "杏仁汤配彩虹鱼籽和莳萝",
      "sv": "Mandelsoppa med regnbågsrom och dill"
    },
    "description": {
      "en": "This is a delicate, creamy soup with a distinctive almond base, often served chilled and elevated by the salty pop of colorful fish roe and the freshness of dill.",
      "zh": "这是一款口感细腻、奶香浓郁的汤，以独特的杏仁为底，通常冷藏后食用，并加入咸香的鱼子和新鲜的莳萝，使其味道更加鲜美。",
      "sv": "Detta är en delikat, krämig soppa med en distinkt mandelbas, ofta serverad kyld och upplyft av den salta doften av färgglad fiskrom och dills fräschör."
    },
    "total_time_min": null,
    "difficulty": {
      "en": "Medium",
      "zh": "中等",
      "sv": "Medel"
    },
    "servings": 6,
    "main_type": {
      "en": "Vegetable",
      "zh": "蔬菜/豆类",
      "sv": "Grönsak"
    },
    "ingredients": {
      "en": [
        "1/2 silver onion",
        "150 g peeled sweet almonds",
        "25 g butter",
        "2 tbsp concentrated chicken or vegetable stock",
        "7 dl water",
        "1 1/2 dl whipping cream",
        "2 tsp sherry or red wine vinegar",
        "salt",
        "black pepper",
        "To serve",
        "80 g rainbow, whitefish or pollock roe",
        "1/2 dl chopped roasted sweet almonds",
        "dill sprigs",
        "olive oil",
        "bread"
      ],
      "zh": [
        "半个银洋葱",
        "150克去皮甜杏仁",
        "25克黄油",
        "2汤匙浓缩鸡汤或蔬菜汤",
        "7分升水",
        "1.5分升鲜奶油",
        "2茶匙雪利酒醋或红酒醋",
        "盐",
        "黑胡椒",
        "佐餐配料",
        "80克虹鳟鱼籽、白鲑鱼籽或狭鳕鱼籽",
        "0.5分升烤甜杏仁碎",
        "莳萝枝",
        "橄榄油",
        "面包"
      ],
      "sv": [
        "1/2 silverlök",
        "150 g skalad sötmandel",
        "25 g smör",
        "2 msk konc kyckling- eller grönsaksfond",
        "7 dl vatten",
        "1 1/2 dl vispgrädde",
        "2 tsk sherry- eller rödvinsvinäger",
        "salt",
        "svartpeppar",
        "Till servering",
        "80 g regnbågs-, sik- eller löjrom",
        "1/2 dl hackad rostad sötmandel",
        "dillvippor",
        "olivolja",
        "bröd"
      ]
    },
    "steps": {
      "en": [
        "Peel and thinly slice the onion. Sauté the onion and almonds in the butter in a saucepan over low heat until the onion softens, about 10 minutes",
        "it should not color.",
        "Pour in the stock and water and let it boil for 10 minutes. Add the cream and cook for another 5 minutes. Let it cool completely. Blend until smooth in a blender and season with vinegar, salt and pepper. Thin with more water if necessary if it is thick. Strain through a fine-mesh sieve.",
        "To serve: Serve the soup cold or warm in a saucepan when serving. Top with the roe, chopped almonds, dill, freshly ground black pepper and drizzle over a little olive oil. Serve with bread if desired."
      ],
      "zh": [
        "将洋葱去皮切成薄片。在平底锅中用黄油小火慢炒洋葱和杏仁，直至洋葱变软，约10分钟；注意不要炒至上色。",
        "倒入高汤和水，煮沸10分钟。加入奶油，再煮5分钟。待其完全冷却后，用搅拌机搅打至顺滑，并用醋、盐和胡椒粉调味。如果汤太稠，可酌情加水稀释。用细网筛过滤。",
        "食用方法：汤可以冷食，也可以盛在平底锅中趁热享用。盛出后撒上鱼子、杏仁碎、莳萝碎、现磨黑胡椒，并淋上少许橄榄油。可根据个人喜好搭配面包食用。"
      ],
      "sv": [
        "Skala och skiva löken tunt. Fräs lök och mandel i smöret i en kastrull på låg värme tills löken mjuknar ca 10 minuter, det ska inte få någon färg.",
        "Häll på fond och vatten och låt koka 10 minuter. Tillsätt grädden och koka ytterligare 5 minuter. Låt svalna helt. Mixa slät i en blender och smaka av med vinäger, salt och peppar. Späd ev med mer vatten om den är tjock. Sila genom en finmaskig sil.",
        "Till servering: Servera soppan kall eller värm i kastrull vid servering. Toppa med rom, hackad mandel, dill, nymalen svartpeppar och ringla över lite olivolja. Servera ev med bröd."
      ]
    },
    "tags": [],
    "cooking_method": {
      "en": "",
      "zh": "",
      "sv": ""
    },
    "tips": {
      "en": "If you want to make the dish lacto-vegetarian: use seaweed caviar instead of roe.",
      "zh": "如果你想把这道菜做成乳素食：用海藻鱼子酱代替鱼卵。",
      "sv": "Vill du göra rätten lakto-vegetarisk: använd tångkaviar istället för rom."
    },
    "taste_preferences": [
      "mild",
      "rich",
      "salty"
    ],
    "image_url": "/Recipe Image/Europe/EU-SP-007.png"
  },
  {
    "id": "EU-SP-008",
    "region": {
      "en": "Europe",
      "zh": "欧洲",
      "sv": "Europa"
    },
    "subcategory": {
      "en": "Spain",
      "zh": "西班牙",
      "sv": "Spain"
    },
    "dish_name": {
      "en": "Blue mussels with pimentón, garlic and white wine",
      "zh": "蓝贻贝配红椒粉、大蒜和白葡萄酒",
      "sv": "Blåmusslor med pimentón, vitlök och vitt vin"
    },
    "description": {
      "en": "This is a Spanish-style seafood dish where fresh blue mussels are steamed open in a broth rich with smoked paprika (pimentón), white wine, and aromatic garlic.",
      "zh": "这是一道西班牙风味的海鲜菜肴，将新鲜的蓝贻贝在富含烟熏辣椒粉（pimentón）、白葡萄酒和香蒜的肉汤中蒸熟。",
      "sv": "Detta är en spansk fiskrätt där färska blåmusslor ångkokas i en buljong rik på rökt paprika (pimentón), vitt vin och aromatisk vitlök."
    },
    "total_time_min": 45,
    "difficulty": {
      "en": "Medium",
      "zh": "中等",
      "sv": "Medel"
    },
    "servings": 4,
    "main_type": {
      "en": "Seafood",
      "zh": "海鲜",
      "sv": "Skaldjur"
    },
    "ingredients": {
      "en": [
        "2 shallots",
        "2 garlic cloves",
        "2 plum tomatoes",
        "1/2 packet saffron (1/2 g each)",
        "1/2 tbsp smoked paprika or pimentón",
        "1 1/2 dl dry white wine",
        "salt",
        "black pepper",
        "1 kg blue mussels",
        "1 dl chopped parsley",
        "olive oil",
        "To serve",
        "bread"
      ],
      "zh": [
        "2 个小洋葱",
        "2 瓣大蒜",
        "2 个李子番茄",
        "半包藏红花（每包 0.5 克）",
        "半汤匙烟熏辣椒粉或西班牙红椒粉",
        "1.5 分升干白葡萄酒",
        "盐",
        "黑胡椒",
        "1 公斤蓝贻贝",
        "1 分升切碎的欧芹",
        "橄榄油",
        "佐餐：面包"
      ],
      "sv": [
        "2 schalottenlökar",
        "2 vitlöksklyftor",
        "2 plommontomater",
        "1/2 paket saffran (à 1/2 g)",
        "1/2 msk rökt paprikapulver eller pimentón",
        "1 1/2 dl torrt vitt vin",
        "salt",
        "svartpeppar",
        "1 kg blåmusslor",
        "1 dl hackad persilja",
        "olivolja",
        "Till servering",
        "bröd"
      ]
    },
    "steps": {
      "en": [
        "Peel and finely chop the onion and garlic. Cut the tomatoes into small cubes. Fry the shallots in 3 tablespoons of oil (for 4-6 servings) in a saucepan until soft without colouring. Add the garlic and fry for another minute.",
        "Add the tomatoes, saffron, paprika and wine. Cook for about 2 minutes. Blend until smooth and strain. Season with salt and pepper.",
        "Rinse and clean the mussels. Discard any that are broken. If any have opened, tap them gently on the kitchen counter. If they do not close, discard them.",
        "Heat 1 tablespoon of oil (for 4-6 servings) in a large saucepan with a lid. Add the mussels and put the lid on for about 1 minute. Add the sauce when the mussels have started to open. Put the lid on and cook until the mussels have opened completely. If any mussels have not opened, discard them.",
        "To serve: Place on a large platter. Top with parsley and drizzle with a little olive oil. Serve with bread."
      ],
      "zh": [
        "将洋葱和大蒜去皮切碎。将番茄切成小丁。在平底锅中用3汤匙油（4-6人份）将红葱头炒软，但不要上色。加入大蒜，再炒1分钟。",
        "加入番茄丁、藏红花、辣椒粉和葡萄酒。煮约2分钟。用搅拌机搅打至顺滑，然后过滤。用盐和胡椒粉调味。",
        "冲洗并清洗贻贝。丢弃任何破损的贻贝。如果贻贝已经开口，轻轻地在厨房台面上敲击。如果它们没有闭合，则丢弃。",
        "在大平底锅中加热1汤匙油（4-6人份）。放入贻贝，盖上盖子焖约1分钟。当贻贝开始开口时，加入酱汁。盖上盖子，煮至贻贝完全开口。如果还有未开口的贻贝，则丢弃。",
        "食用方法：盛于大盘中。撒上欧芹碎，淋上少许橄榄油。配面包食用。"
      ],
      "sv": [
        "Skala och finhacka lök och vitlök. Skär tomaterna i små tärningar. Fräs schalottenlöken i 3 msk olja (för 4-6 port) i en kastrull tills den mjuknar utan att den får färg. Tillsätt vitlöken och låt fräsa ytterligare någon minut.",
        "Tillsätt tomater, saffran, paprikapulver och vin. Låt koka ca 2 minuter. Mixa slät och sila. Smaka av med salt och peppar.",
        "Skölj och rensa musslorna. Släng de som är trasiga. Om någon har öppnat sig så knacka den försiktigt mot köksbänken. Stänger den sig inte så släng den.",
        "Värm 1 msk olja (för 4-6 port) i en stor kastrull med lock. Lägg ner musslorna och sätt på locket ca 1 minut. Tillsätt såsen när musslorna börjat öppna sig. Sätt på locket och låt koka tills musslorna öppnat sig helt, om någon mussla inte öppnat sig släng den.",
        "Till servering: Lägg upp på ett stort fat. Toppa med persilja och ringla gärna över lite olivolja. Servera gärna med bröd."
      ]
    },
    "tags": [],
    "cooking_method": {
      "en": "",
      "zh": "",
      "sv": ""
    },
    "taste_preferences": [
      "salty",
      "mild",
      "rich"
    ],
    "image_url": "/Recipe Image/Europe/EU-SP-008.png"
  },
  {
    "id": "EU-SP-009",
    "region": {
      "en": "Europe",
      "zh": "欧洲",
      "sv": "Europa"
    },
    "subcategory": {
      "en": "Spain",
      "zh": "西班牙",
      "sv": "Spain"
    },
    "dish_name": {
      "en": "Cod with roasted peppers, garlic and chili",
      "zh": "烤甜椒、大蒜和辣椒鳕鱼",
      "sv": "Torsk med rostad paprika, vitlök och chili"
    },
    "description": {
      "en": "This is a simple yet vibrant Mediterranean dish featuring flaky cod fillets baked with sweet roasted bell peppers, garlic, and a spicy kick of chili.",
      "zh": "这是一道简单却充满活力的地中海菜肴，以酥脆的鳕鱼片搭配甜美的烤甜椒、大蒜和辛辣的辣椒一起烘烤而成。",
      "sv": "Detta är en enkel men livfull medelhavsrätt med flagnande torskfiléer bakade med sötrostad paprika, vitlök och en kryddig chili."
    },
    "total_time_min": null,
    "difficulty": {
      "en": "Easy",
      "zh": "简单",
      "sv": "Lätt"
    },
    "servings": 4,
    "main_type": {
      "en": "Seafood",
      "zh": "海鲜",
      "sv": "Skaldjur"
    },
    "ingredients": {
      "en": [
        "Grilled peppers",
        "3 red peppers",
        "1 tbsp olive oil (for roasting in the oven)",
        "2 cloves of garlic",
        "1/2 red pepper (chili)",
        "1/2 dl olive oil (for the salsa)",
        "salt",
        "Potatoes",
        "600 g potatoes",
        "1 silver onion",
        "2 tbsp olive oil",
        "3/4 tsp salt",
        "1/2 tsp black pepper",
        "1/2 dl roasted pine nuts",
        "1 dl chopped parsley",
        "Cod",
        "4 pieces of cod loin (approx. 150 g each)",
        "1/2 tsp salt",
        "Serving suggestions",
        "pine nuts",
        "parsley",
        "olive oil",
        "flaked salt"
      ],
      "zh": [
        "烤甜椒",
        "3 个红甜椒",
        "1 汤匙橄榄油（用于烤箱烘烤）",
        "2 瓣大蒜",
        "半个红辣椒（辣椒）",
        "半升橄榄油（用于莎莎酱）",
        "盐",
        "土豆",
        "600 克土豆",
        "1 个银洋葱",
        "2 汤匙橄榄油",
        "3/4 茶匙盐",
        "1/2 茶匙黑胡椒",
        "半升烤松子",
        "1 分升切碎的欧芹",
        "鳕鱼",
        "4 块鳕鱼柳（每块约 150 克）",
        "1/2 茶匙盐",
        "食用建议",
        "松子",
        "欧芹",
        "橄榄油",
        "片状盐"
      ],
      "sv": [
        "Grillad paprika",
        "3 röda paprikor",
        "1 msk olivolja (till rostning i ugnen)",
        "2 vitlöksklyftor",
        "1/2 röd peppar (chili)",
        "1/2 dl olivolja (till salsan)",
        "salt",
        "Potatis",
        "600 g potatis",
        "1 silverlök",
        "2 msk olivolja",
        "3/4 tsk salt",
        "1/2 tsk svartpeppar",
        "1/2 dl rostade pinjenötter",
        "1 dl hackad persilja",
        "Torsk",
        "4 bitar torskrygg (à ca 150 g)",
        "1/2 tsk salt",
        "Serveringsförslag",
        "pinjenötter",
        "persilja",
        "olivolja",
        "flingsalt"
      ]
    },
    "steps": {
      "en": [
        "Set the oven to 250°C grill/top heat.",
        "Peppers: Place the peppers in a baking dish and mix with oil. Place in the middle of the oven for about 15 minutes until the skin is black, turn halfway through. Place the hot peppers in a bowl and cover with plastic wrap. Let cool. Then remove the skin and core the peppers.",
        "Set the oven to 175°C.",
        "Potatoes: Peel and slice the potatoes and onion thinly. Place in a baking dish with oil, salt and pepper. Place in the middle of the oven for about 30 minutes or until the potatoes are soft.",
        "Peppers: Cut the roasted peppers into small cubes. Peel and chop the garlic. Remove the core and chop the chili. Mix the peppers, garlic and chili with the oil to make a salsa. Season with salt.",
        "Cod: Season the cod with salt all around. Place the fish on the potatoes, spread the salsa over the fish and potatoes. Place in the middle of the oven for 10–15 minutes or until the fish has an internal temperature of 56°C.",
        "Serving suggestion: Top with pine nuts, parsley, extra virgin olive oil and flaked salt."
      ],
      "zh": [
        "将烤箱预热至250°C（烧烤/上火）。",
        "甜椒：将甜椒放入烤盘中，拌入油。放入烤箱中层烤约15分钟，直至表皮变黑，中途翻面。将烤好的甜椒放入碗中，盖上保鲜膜。待其冷却后，剥去表皮并去除辣椒籽。",
        "将烤箱预热至175°C。",
        "土豆：将土豆和洋葱去皮切薄片。放入烤盘中，加入油、盐和胡椒粉。放入烤箱中层烤约30分钟，或直至土豆变软。",
        "甜椒：将烤好的甜椒切成小丁。大蒜去皮切碎。辣椒去籽切碎。将甜椒、大蒜和辣椒与油混合，制成莎莎酱。加盐调味。",
        "鳕鱼：将鳕鱼均匀地撒上盐。将鱼放在土豆上，淋上莎莎酱。放入烤箱中层烤10-15分钟，或烤至鱼肉内部温度达到56°C。",
        "食用建议：撒上松子、欧芹碎、特级初榨橄榄油和片状海盐。"
      ],
      "sv": [
        "Sätt ugnen på 250°C grill/övervärme.",
        "Paprika: Lägg paprikorna i en ugnsform och blanda med olja. Ställ in i mitten av ugnen ca 15 minuter tills skalet är svart, vänd efter halva tiden. Lägg de varma paprikorna i en bunke och täck med plastfolie. Låt svalna. Ta sedan bort skalet och kärna ur paprikorna.",
        "Sätt ugnen på 175°C.",
        "Potatis: Skala och skiva potatis och lök tunt. Lägg i en ugnsform med olja, salt och peppar. Ställ in i mitten av ugnen först ca 30 minuter eller tills potatisen är mjuk.",
        "Paprika: Skär den rostade paprikan i små tärningar. Skala och hacka vitlöken. Kärna ur och hacka chilin. Blanda paprika, vitlök och chili med oljan till en salsa. Smaka av med salt.",
        "Torsk: Krydda torsken med salt runtom. Lägg fisken på potatisen, fördela salsan över fisken och potatisen. Ställ in i mitten av ugnen 10–15 minuter eller tills fisken har en innertemperatur på 56°C.",
        "Serveringsförslag: Toppa med pinjenötter, persilja, extra olivolja och flingsalt."
      ]
    },
    "tags": [],
    "cooking_method": {
      "en": "",
      "zh": "",
      "sv": ""
    },
    "tips": {
      "en": "Buy ready-made whole grilled peppers in a jar.\r\nServe with grilled or fried lemon.",
      "zh": "购买罐装的现成烤整椒。\r\n搭配烤柠檬或炸柠檬食用。",
      "sv": "Köp färdig hel grillad paprika på burk.\r\nServera gärna med grillad eller stekt citron."
    },
    "taste_preferences": [
      "mild",
      "sweet",
      "spicy"
    ],
    "image_url": "/Recipe Image/Europe/EU-SP-009.png"
  },
  {
    "id": "EU-FR-001",
    "region": {
      "en": "Europe",
      "zh": "欧洲",
      "sv": "Europa"
    },
    "subcategory": {
      "en": "France",
      "zh": "法国",
      "sv": "France"
    },
    "dish_name": {
      "en": "Coq au Vin",
      "zh": "红酒炖鸡",
      "sv": "Coq au Vin"
    },
    "description": {
      "en": "A classic French casserole where chicken is braised in red wine, mushrooms, and bacon.",
      "zh": "一道经典的法式砂锅菜，鸡肉用红酒、蘑菇和培根炖煮而成。",
      "sv": "En klassisk fransk gryta där kyckling bräseras i rött vin, svamp och bacon."
    },
    "total_time_min": 45,
    "difficulty": {
      "en": "Medium",
      "zh": "中等",
      "sv": "Medel"
    },
    "servings": 4,
    "main_type": {
      "en": "Meat",
      "zh": "肉类",
      "sv": "Kött"
    },
    "ingredients": {
      "en": [
        "500 g chicken thigh fillet or chicken breast fillet",
        "1/2 tsp salt",
        "1 pinch black pepper",
        "100 g smoked pork belly or bacon (100 g pork belly is equivalent to 1 pack of bacon à 140 g)",
        "2 shallots",
        "2 cloves of garlic",
        "1 leek",
        "150 g mushrooms",
        "butter for frying",
        "3 dl red wine",
        "1 dl water",
        "2 tbsp chicken stock",
        "1 tbsp Japanese soy sauce",
        "2 bay leaves",
        "1 tsp dried thyme",
        "1 tbsp cornstarch",
        "To serve",
        "boiled potatoes and fresh chopped parsley"
      ],
      "zh": [
        "500克鸡腿肉或鸡胸肉",
        "1/2茶匙盐",
        "少许黑胡椒",
        "100克烟熏五花肉或培根（100克五花肉相当于1包培根，约140克）",
        "2个小洋葱",
        "2瓣大蒜",
        "1根韭葱",
        "150克蘑菇",
        "煎炸用黄油",
        "3分升红酒",
        "1分升水",
        "2汤匙鸡汤",
        "1汤匙日式酱油",
        "2片月桂叶",
        "1茶匙干百里香",
        "1汤匙玉米淀粉",
        "佐以",
        "煮土豆和新鲜切碎的欧芹"
      ],
      "sv": [
        "500 g kycklinglårfilé eller kycklingfilé av bröst",
        "1/2 tsk salt",
        "1 krm svartpeppar",
        "100 g rökt sidfläsk eller bacon (100 g sidfläsk motsvarar 1 paket bacon à 140 g)",
        "2 schalottenlökar",
        "2 vitlöksklyftor",
        "1 purjolök",
        "150 g champinjoner",
        "smör till stekning",
        "3 dl rödvin",
        "1 dl vatten",
        "2 msk kycklingfond",
        "1 msk japansk soja",
        "2 lagerblad",
        "1 tsk torkad timjan",
        "1 msk majsstärkelse",
        "Till servering",
        "kokt potatis och färsk hackad persilja"
      ]
    },
    "steps": {
      "en": [
        "Cut the chicken into large pieces and season with salt and pepper. Shred the pork. Peel and chop the shallot. Peel and grate the garlic. Rinse, trim and roughly chop the leek and chop the mushrooms if necessary.",
        "Brown the chicken all over in butter in a frying pan and place it in a saucepan.",
        "Pour wine and water into the saucepan. Add stock, soy, bay leaf and thyme. Let it cook for about 5 minutes under the lid.",
        "Meanwhile, fry the pork, onion, leek and mushrooms. Put it in the saucepan and let it cook for another 5 minutes.",
        "Stir the cornstarch in a little cold water and stir it into the saucepan. Let it boil.",
        "Serve with boiled potatoes and chopped parsley."
      ],
      "zh": [
        "将鸡肉切成大块，用盐和胡椒粉调味。将猪肉撕成丝。将红葱头去皮切碎。将大蒜去皮磨碎。将韭葱洗净、去根并大致切碎，如果需要，将蘑菇切碎。",
        "用黄油在煎锅中将鸡肉煎至表面金黄，然后放入汤锅中。",
        "将葡萄酒和水倒入汤锅中。加入高汤、酱油、月桂叶和百里香。盖上锅盖，煮约5分钟。",
        "同时，将猪肉丝、洋葱、韭葱和蘑菇炒熟。将它们放入汤锅中，再煮5分钟。",
        "将玉米淀粉用少量冷水调匀，然后倒入汤锅中。煮沸。",
        "搭配煮土豆和切碎的欧芹即可享用。"
      ],
      "sv": [
        "Skär kycklingen i stora bitar och krydda med salt och peppar. Strimla fläsket. Skala och dela schalottenlöken. Skala och riv vitlöken. Skölj, ansa och grovstrimla purjolöken och dela eventuellt svampen.",
        "Bryn kycklingen runt om i smör i en stekpanna och lägg över den i en gryta.",
        "Häll på vin och vatten i grytan. Tillsätt fond, soja, lagerblad och timjan. Låt koka ca 5 minuter under lock.",
        "Stek under tiden fläsk, lök, purjolök och svamp. Lägg ner det i grytan och låt koka i ytterligare 5 minuter.",
        "Rör ut majsstärkelsen i lite kallt vatten och rör ner det i grytan. Låt koka upp.",
        "Servera med kokt potatis och hackad persilja."
      ]
    },
    "tags": [],
    "cooking_method": {
      "en": "",
      "zh": "",
      "sv": ""
    },
    "taste_preferences": [
      "rich",
      "sour"
    ],
    "image_url": "/Recipe Image/Europe/EU-FR-001.png"
  },
  {
    "id": "EU-FR-002",
    "region": {
      "en": "Europe",
      "zh": "欧洲",
      "sv": "Europa"
    },
    "subcategory": {
      "en": "France",
      "zh": "法国",
      "sv": "France"
    },
    "dish_name": {
      "en": "Vegetarian Bouillabaisse with Dill Mayonnaise",
      "zh": "素马赛蔬菜汤配莳萝蛋黄酱",
      "sv": "Vegobouillabaisse med dillmajonnäs"
    },
    "description": {
      "en": "A vegetarian version of the traditional French fish stew from Marseille, flavored with saffron and herbs.",
      "zh": "这是马赛传统法式鱼汤的素食版本，用藏红花和香草调味。",
      "sv": "En vegetarisk version av den traditionella franska fiskgrytan från Marseille, smaksatt med saffran och örter."
    },
    "total_time_min": 45,
    "difficulty": {
      "en": "Medium",
      "zh": "中等",
      "sv": "Medel"
    },
    "servings": 4,
    "main_type": {
      "en": "Vegetable",
      "zh": "蔬菜/豆类",
      "sv": "Grönsak"
    },
    "ingredients": {
      "en": [
        "1 bake off sourdough baguette (250 g each)",
        "900 g potatoes",
        "1 pre-cooked black beans (380 g each)",
        "1 fennel (approx. 300 g each)",
        "1 red onion",
        "1 carrot",
        "1 red bell pepper",
        "1 red pepper (chili)",
        "1 tbsp olive oil",
        "1 clove garlic",
        "1/2 g saffron",
        "500 g pureed tomatoes",
        "1 vegetable stock cube",
        "2 dl water",
        "salt",
        "pepper",
        "20 g fresh dill (half for the pot and half for the mayonnaise)",
        "2 dl mayonnaise",
        "1 clove garlic"
      ],
      "zh": [
        "1根烤好的酸面包法棍（每根250克）",
        "900克土豆",
        "1包预煮黑豆（每包380克）",
        "1个茴香（每个约300克）",
        "1个红洋葱",
        "1根胡萝卜",
        "1个红甜椒",
        "1个红辣椒",
        "1汤匙橄榄油",
        "1瓣大蒜",
        "0.5克藏红花",
        "500克番茄泥",
        "1块蔬菜浓汤宝",
        "2分升水",
        "盐",
        "胡椒粉",
        "20克新鲜莳萝（一半用于汤，一半用于蛋黄酱）",
        "2分升蛋黄酱",
        "1瓣大蒜"
      ],
      "sv": [
        "1 bake off surdegsbaguette (à 250 g)",
        "900 g potatis",
        "1 förp kokta svarta bönor (à 380 g)",
        "1 fänkål (à ca 300 g)",
        "1 rödlök",
        "1 morot",
        "1 röd paprika",
        "1 röd peppar (chili)",
        "1 msk olivolja",
        "1 vitlöksklyfta",
        "1/2 g saffran",
        "500 g passerade tomater",
        "1 grönsaksbuljongtärning",
        "2 dl vatten",
        "salt",
        "peppar",
        "20 g färsk dill (hälften till grytan och hälften till majonnäsen)",
        "2 dl majonnäs",
        "1 vitlöksklyfta"
      ]
    },
    "steps": {
      "en": [
        "Turn on the oven and cook the baguette according to the instructions on the package.",
        "Peel and boil the potatoes.",
        "Put the beans in a colander, rinse them in cold water and let them drain.",
        "Trim and slice the fennel thinly. Peel and slice the onion and carrot into thin slices. Halve, core and cut the bell pepper into wide strips. Slice the chilli into thin slices.",
        "Sauté the vegetables in the oil in a saucepan and press in the garlic.",
        "Stir in the saffron, pureed tomatoes, crumbled stock cube and water. Simmer for 5 minutes, then stir in the beans and let them heat through. Season with salt and pepper.",
        "Chop the dill and stir half into the stew.",
        "Mix the rest of the dill with mayonnaise and press in the garlic. Season with salt and pepper.",
        "Serve the stew with mayonnaise and baguette."
      ],
      "zh": [
        "打开烤箱，按照包装上的说明烤法棍面包。",
        "土豆去皮煮熟。",
        "豆角放入滤网，用冷水冲洗，沥干水分。",
        "茴香去蒂切薄片。洋葱和胡萝卜去皮切薄片。甜椒对半切开，去籽，切成宽条。辣椒切薄片。",
        "在平底锅中用油炒蔬菜，加入蒜末。",
        "加入藏红花、番茄泥、捏碎的浓汤宝和水。小火慢炖5分钟，然后加入豆角，煮至豆角熟透。用盐和胡椒粉调味。",
        "莳萝切碎，取一半加入炖菜中。",
        "将剩余的莳萝与蛋黄酱混合，加入蒜末。用盐和胡椒粉调味。",
        "将炖菜配上蛋黄酱和法棍面包即可享用。"
      ],
      "sv": [
        "Sätt på ugnen och tillaga baguetten enligt anvisningen på förpackningen.",
        "Skala och koka potatisen.",
        "Häll bönorna i en sil, spola dem i kallt vatten och låt rinna av.",
        "Ansa och skiva fänkålen tunt. Skala och skär lök och morot i tunna skivor. Dela, kärna ur och skär paprikan i breda strimlor. Skär chilin i tunna skivor.",
        "Fräs grönsakerna i oljan i en gryta och pressa i vitlöken.",
        "Rör i saffran, passerade tomater, smulad buljongtärning och vatten. Låt sjuda 5 minuter, rör sedan i bönorna och låt de bli varma. Smaka av med salt och peppar.",
        "Hacka dillen och rör ner hälften i grytan.",
        "Blanda resten av dillen med majonnäs och pressa i vitlök. Smaka av med salt och peppar.",
        "Servera grytan med majonnäs och baguette."
      ]
    },
    "tags": [],
    "cooking_method": {
      "en": "",
      "zh": "",
      "sv": ""
    },
    "taste_preferences": [
      "mild",
      "salty"
    ],
    "image_url": "/Recipe Image/Europe/EU-FR-002.png"
  },
  {
    "id": "EU-FR-003",
    "region": {
      "en": "Europe",
      "zh": "欧洲",
      "sv": "Europa"
    },
    "subcategory": {
      "en": "France",
      "zh": "法国",
      "sv": "France"
    },
    "dish_name": {
      "en": "Chicken Bourguignon",
      "zh": "勃艮第红酒炖鸡",
      "sv": "Kycklingbourguignon"
    },
    "description": {
      "en": "A French stew similar to Coq au Vin, using chicken braised in red wine from the Burgundy region.",
      "zh": "一道类似于红酒炖鸡的法式炖菜，用勃艮第地区的红酒炖煮鸡肉。",
      "sv": "En fransk gryta liknande Coq au Vin, med kyckling bräserad i rött vin från Bourgogne."
    },
    "total_time_min": 45,
    "difficulty": {
      "en": "Medium",
      "zh": "中等",
      "sv": "Medel"
    },
    "servings": 4,
    "main_type": {
      "en": "Meat",
      "zh": "肉类",
      "sv": "Kött"
    },
    "ingredients": {
      "en": [
        "900 g potatoes",
        "Casserole",
        "1 pack bacon (140 g each)",
        "250 g chestnut mushrooms",
        "1 tbsp oil",
        "300 g chicken thigh fillet",
        "150 g snack carrots",
        "1 clove garlic",
        "2 tbsp tomato paste",
        "2 tbsp balsamic vinegar",
        "2 1/2 dl red cooking wine",
        "1 chicken stock cube",
        "2 dl water",
        "1 tsp dried thyme",
        "2 bay leaves",
        "2 tsp cornstarch",
        "340 g pickled onions",
        "1 pack fresh parsley (20 g each)",
        "salt",
        "pepper",
        "1 head of lettuce (crunchita)"
      ],
      "zh": [
        "900克土豆",
        "砂锅菜",
        "1包培根（每包140克）",
        "250克栗蘑",
        "1汤匙油",
        "300克鸡腿肉",
        "150克胡萝卜",
        "1瓣大蒜",
        "2汤匙番茄酱",
        "2汤匙香醋",
        "2.5分升红葡萄酒",
        "1块鸡汤块",
        "2分升水",
        "1茶匙干百里香",
        "2片月桂叶",
        "2茶匙玉米淀粉",
        "340克腌洋葱",
        "1包新鲜欧芹（每包20克）",
        "盐",
        "胡椒粉",
        "1棵生菜（脆叶生菜）"
      ],
      "sv": [
        "900 g potatis",
        "Gryta",
        "1 förp bacon (à 140 g)",
        "250 g kastanjechampinjoner",
        "1 msk olja",
        "300 g kycklinglårfilé",
        "150 g snackmorot",
        "1 vitlöksklyfta",
        "2 msk tomatpuré",
        "2 msk balsamvinäger",
        "2 1/2 dl rött matlagningsvin",
        "1 kycklingbuljongtärning",
        "2 dl vatten",
        "1 tsk torkad timjan",
        "2 lagerblad",
        "2 tsk majsstärkelse",
        "340 g syltlök",
        "1 förp färsk persilja (à 20 g)",
        "salt",
        "peppar",
        "1 salladshuvud (crunchita)"
      ]
    },
    "steps": {
      "en": [
        "Boil the potatoes.",
        "Casserole: Slice the bacon and trim and quarter the mushrooms. Fry the bacon and mushrooms in half the oil in a saucepan.",
        "Cut the chicken and carrots into pieces. Lift out the bacon and mushroom mince and fry the chicken and carrots in the remaining oil in the saucepan. Press in the garlic and stir in the tomato puree.",
        "Add the bacon and mushroom mince, vinegar, wine, crumbled stock cube, water, thyme and bay leaf to the saucepan and simmer for 10 minutes.",
        "Deglaze the saucepan with the cornstarch dissolved in a little water. Pour off the pickled onion and stir into the saucepan. Chop and stir in the parsley, season with salt and pepper.",
        "Cut the salad into pieces.",
        "Serve the casserole with potatoes and salad."
      ],
      "zh": [
        "将土豆煮熟。",
        "砂锅菜：将培根切片，蘑菇去蒂切块。在平底锅中用一半的油煎培根和蘑菇。",
        "将鸡肉和胡萝卜切块。取出培根和蘑菇碎，用平底锅中剩余的油煎鸡肉和胡萝卜。压入蒜末，拌入番茄酱。",
        "将培根和蘑菇碎、醋、葡萄酒、捏碎的浓汤宝、水、百里香和月桂叶放入平底锅中，小火慢炖10分钟。",
        "用少量水溶解玉米淀粉，将平底锅中的焦糊物刮起。倒出腌洋葱，拌入平底锅中。切碎欧芹，拌入，用盐和胡椒调味。",
        "将沙拉切成块。",
        "将砂锅菜与土豆和沙拉一起享用。"
      ],
      "sv": [
        "Koka potatisen.",
        "Gryta: Skiva baconet och ansa och skär champinjonerna i fjärdedelar. Stek bacon och svamp i hälften oljan i en gryta.",
        "Skär kycklingen och morötterna i bitar. Lyft upp bacon- och svampfräset och stek sedan kycklingen och morötterna i resten av oljan i grytan. Pressa i vitlöken och rör i tomatpurén.",
        "Tillsätt bacon- och svampfräset, vinäger, vin, smulad buljongtärning, vatten, timjan och lagerblad i grytan och låt sjuda i 10 minuter.",
        "Red av grytan med majsstärkelsen utrörd i lite vatten. Häll av syltlöken och rör ner den i grytan. Hacka och rör i persiljan, smaka av med salt och peppar.",
        "Skär salladen i bitar.",
        "Servera grytan med potatis och sallad."
      ]
    },
    "tags": [],
    "cooking_method": {
      "en": "",
      "zh": "",
      "sv": ""
    },
    "taste_preferences": [
      "rich",
      "sour",
      "salty"
    ],
    "image_url": "/Recipe Image/Europe/EU-FR-003.png"
  },
  {
    "id": "EU-FR-004",
    "region": {
      "en": "Europe",
      "zh": "欧洲",
      "sv": "Europa"
    },
    "subcategory": {
      "en": "France",
      "zh": "法国",
      "sv": "France"
    },
    "dish_name": {
      "en": "Niçoise Salad",
      "zh": "尼斯沙拉",
      "sv": "Niçoise Salad"
    },
    "description": {
      "en": "A French salad from the city of Nice, featuring tuna, boiled eggs, olives, and fresh vegetables.",
      "zh": "一道来自法国尼斯的沙拉，配料包括金枪鱼、煮鸡蛋、橄榄和新鲜蔬菜。",
      "sv": "En fransk sallad från staden Nice, med tonfisk, kokta ägg, oliver och färska grönsaker."
    },
    "total_time_min": 45,
    "difficulty": {
      "en": "Medium",
      "zh": "中等",
      "sv": "Medel"
    },
    "servings": 4,
    "main_type": {
      "en": "Seafood",
      "zh": "海鲜",
      "sv": "Skaldjur"
    },
    "ingredients": {
      "en": [
        "500 g potatoes",
        "150 g haricots verts (beans)",
        "4 eggs",
        "2 cans of tuna in oil or water (200 g each)",
        "1 can of anchovies (50 g each)",
        "1 red onion",
        "3 tomatoes",
        "1 pot of lettuce (preferably crisp lettuce)",
        "3 tbsp olive oil",
        "1 tbsp vinegar",
        "1/2 tsp salt",
        "1 pinch black pepper",
        "2 tbsp chopped herbs (e.g. parsley, rosemary and thyme)",
        "about 25 black olives",
        "To serve",
        "bread"
      ],
      "zh": [
        "500克土豆",
        "150克四季豆",
        "4个鸡蛋",
        "2罐油浸或水浸金枪鱼（每罐200克）",
        "1罐凤尾鱼（每罐50克）",
        "1个红洋葱",
        "3个西红柿",
        "1盆生菜（最好是脆生菜）",
        "3汤匙橄榄油",
        "1汤匙醋",
        "1/2茶匙盐",
        "少许黑胡椒",
        "2汤匙切碎的香草（例如欧芹、迷迭香和百里香）",
        "约25颗黑橄榄",
        "佐以面包"
      ],
      "sv": [
        "500 g potatis",
        "150 g haricots verts (bönor)",
        "4 ägg",
        "2 burkar tonfisk i olja eller vatten (à 200 g)",
        "1 burk sardeller (à 50 g)",
        "1 rödlök",
        "3 tomater",
        "1 kruka sallad (gärna krispsallad)",
        "3 msk olivolja",
        "1 msk vinäger",
        "1/2 tsk salt",
        "1 krm svartpeppar",
        "2 msk hackade örter (t ex persilja, rosmarin och timjan)",
        "ca 25 svarta oliver",
        "Till servering",
        "bröd"
      ]
    },
    "steps": {
      "en": [
        "Peel and boil the potatoes. Trim the beans and cook them together with the potatoes for the last 5 minutes of the potatoes' cooking time.",
        "Place the eggs in boiling water and cook for 7 minutes. Rinse the eggs in cold water. Peel and cut the eggs in half.",
        "Drain the tuna and anchovies separately in a sieve.",
        "Peel and slice the onion. Cut the tomatoes into pieces. Rinse, trim and cut the salad into pieces.",
        "Mix the oil, vinegar, salt, pepper and herbs in a large bowl. Add the onion, tomatoes, olives and tuna.",
        "Let the potatoes steam and cut into pieces. Gently stir the potatoes, beans and salad into the bowl. Top with the anchovies and eggs.",
        "To serve: Serve the salad with bread."
      ],
      "zh": [
        "将土豆去皮煮熟。将豆角去蒂，与土豆一起煮，在土豆煮熟的最后5分钟加入。",
        "将鸡蛋放入沸水中煮7分钟。用冷水冲洗鸡蛋。剥壳后切成两半。",
        "将金枪鱼和凤尾鱼分别沥干水分。",
        "将洋葱去皮切片。将西红柿切块。将沙拉洗净、去蒂并切成块。",
        "在一个大碗中混合油、醋、盐、胡椒粉和香草。加入洋葱、西红柿、橄榄和金枪鱼。",
        "将土豆蒸熟后切成块。将土豆、豆角和沙拉轻轻拌入碗中。最后放上凤尾鱼和鸡蛋。",
        "食用方法：将沙拉与面包一起食用。"
      ],
      "sv": [
        "Skala och koka potatisen. Ansa bönorna och koka dem tillsammans med potatisen de sista 5 minuterna på potatisens koktid.",
        "Lägg äggen i kokande vatten och koka dem i 7 minuter. Spola äggen kalla. Skala och dela äggen i halvor.",
        "Låt tonfisken och sardellerna rinna av var för sig i en sil.",
        "Skala och skiva löken. Skär tomaterna i bitar. Skölj, ansa och dela salladen i bitar.",
        "Blanda olja, vinäger, salt, peppar och örter i en stor skål. Lägg i lök, tomater, oliver och tonfisk.",
        "Låt potatisen ånga av och skär den i bitar. Rör försiktigt ner potatis, bönor och sallad i skålen. Toppa med sardeller och ägg.",
        "Till servering: Servera gärna salladen med bröd."
      ]
    },
    "tags": [],
    "cooking_method": {
      "en": "",
      "zh": "",
      "sv": ""
    },
    "taste_preferences": [
      "mild",
      "salty",
      "sour"
    ],
    "image_url": "/Recipe Image/Europe/EU-FR-004.png"
  },
  {
    "id": "EU-FR-005",
    "region": {
      "en": "Europe",
      "zh": "欧洲",
      "sv": "Europa"
    },
    "subcategory": {
      "en": "France",
      "zh": "法国",
      "sv": "France"
    },
    "dish_name": {
      "en": "Quiche Lorraine",
      "zh": "法式培根蛋挞",
      "sv": "Quiche Lorraine"
    },
    "description": {
      "en": "A savory French tart originating from the Lorraine region, filled with egg, cream, and bacon/lardons.",
      "zh": "一种源自法国洛林地区的咸味馅饼，馅料包括鸡蛋、奶油和培根/咸肉丁。",
      "sv": "En smakrik fransk paj med ursprung i Lorraine-regionen, fylld med ägg, grädde och bacon/spekbullar."
    },
    "total_time_min": null,
    "difficulty": {
      "en": "Medium",
      "zh": "中等",
      "sv": "Medel"
    },
    "servings": 6,
    "main_type": {
      "en": "Meat",
      "zh": "肉类",
      "sv": "Kött"
    },
    "ingredients": {
      "en": [
        "Crust",
        "3 dl wheat flour",
        "1 tsp salt",
        "100 g butter or margarine",
        "2 1/2 tbsp water",
        "Filling",
        "150 g smoked sliced ​​ham",
        "150 g cheese (with a strong flavour)",
        "4 eggs",
        "2 dl milk",
        "2 dl heavy cream",
        "1 tsp black pepper"
      ],
      "zh": [
        "主要材料",
        "饼皮",
        "3分升小麦粉",
        "1茶匙盐",
        "100克黄油或人造黄油",
        "2.5汤匙水",
        "馅料",
        "150克烟熏火腿片",
        "150克浓郁奶酪",
        "4个鸡蛋",
        "2分升牛奶",
        "2分升浓奶油",
        "1茶匙黑胡椒"
      ],
      "sv": [
        "Botten",
        "3 dl vetemjöl",
        "1 krm salt",
        "100 g smör eller margarin",
        "2 1/2 msk vatten",
        "Fyllning",
        "150 g rökt skivad skinka",
        "150 g ost (med stark smak)",
        "4 ägg",
        "2 dl mjölk",
        "2 dl mellangrädde",
        "1 krm svartpeppar"
      ]
    },
    "steps": {
      "en": [
        "Base: Place flour, salt, and shortening cut into small pieces in a food processor or directly on the baking sheet. Chop together into a crumbly mass. Add the water and quickly work the dough together. Flatten the dough slightly and wrap it in plastic wrap. Let it cool, about 30 minutes.",
        "Roll out the dough to a plate that covers both the bottom and the edge of a pie pan, 24-26 cm in diameter (for 6 servings). Line the pan with the dough and prick it with a fork. Cover the edges with baking foil. Pre-bake the pie shell in the lower part of the oven at 200°C, about 10 minutes. Remove the foil.",
        "Filling: Cut the ham into strips. Grate the cheese. Put everything in the pie shell. Whisk together the eggs and liquid. Season with pepper carefully. Pour the egg mixture over the ham and cheese mixture. Bake the pie in the lower part of the oven at 200°C, 30-40 minutes. Serve the pie warm with a mixed green salad."
      ],
      "zh": [
        "派底：将面粉、盐和切成小块的起酥油放入食品加工机或直接铺在烤盘上。将它们混合成碎屑状。加入水，快速揉成面团。将面团略微压扁，用保鲜膜包裹。冷却约30分钟。",
        "将面团擀成一张大小合适的纸，铺满直径24-26厘米的派盘底部和边缘（6人份）。将面团铺在派盘底部，用叉子戳一些小孔。用锡纸盖住派盘边缘。将派皮放入预热至200°C的烤箱下层，烘烤约10分钟。取出锡纸。",
        "馅料：将火腿切成条状。将奶酪擦成丝。将所有食材放入派皮中。将鸡蛋和液体搅拌均匀。小心地加入胡椒粉调味。将蛋液倒在火腿和奶酪混合物上。将派放​​入预热至200°C的烤箱下层，烘烤30-40分钟。将馅饼趁热配上混合蔬菜沙拉一起食用。"
      ],
      "sv": [
        "Botten: Lägg mjöl, salt, och matfett skuret i mindre bitar, i en matberedare eller direkt på bakbordet. Hacka samman till en grynig massa. Tillsätt vattnet och arbeta snabbt ihop degen. Platta ut degen något och linda in den i plastfolie. Låt den ligga kallt, ca 30 min.",
        "Kavla ut degen till en platta som täcker både botten och kanten på en pajform, 24-26 cm i diameter (för 6 port). Klä formen med degen och nagga den med en gaffel. Täck kanterna med ugnsfolie. Förgrädda pajskalet i nedre delen av ugnen i 200°C, ca 10 min. Ta bort folien.",
        "Fyllning: Skär skinkan i strimlor. Riv osten. Lägg allt i pajskalet. Vispa samman ägg och vätska. Peppra försiktigt. Häll",
        "äggstanningen över skink- och ostblandningen. Grädda pajen i nedre delen av ugnen i 200°C, 30-40 min. Servera pajen varm med en blandad grönsallad."
      ]
    },
    "tags": [],
    "cooking_method": {
      "en": "",
      "zh": "",
      "sv": ""
    },
    "taste_preferences": [
      "rich",
      "salty"
    ],
    "image_url": "/Recipe Image/Europe/EU-FR-005.png"
  },
  {
    "id": "EU-FR-006",
    "region": {
      "en": "Europe",
      "zh": "欧洲",
      "sv": "Europa"
    },
    "subcategory": {
      "en": "France",
      "zh": "法国",
      "sv": "France"
    },
    "dish_name": {
      "en": "Tarte Flambée",
      "zh": "法式火焰薄饼",
      "sv": "Tarte Flambée"
    },
    "description": {
      "en": "A thin, crisp Alsatian/German flatbread spread with crème fraîche, onions, and bacon.",
      "zh": "一种薄脆的阿尔萨斯/德国扁面包，涂抹着鲜奶油、洋葱和培根。",
      "sv": "Ett tunt, krispigt tunnbröd från Alsace/Tyskland med crème fraîche, lök och bacon."
    },
    "total_time_min": null,
    "difficulty": {
      "en": "Medium",
      "zh": "中等",
      "sv": "Medel"
    },
    "servings": 3,
    "main_type": {
      "en": "Meat",
      "zh": "肉类",
      "sv": "Kött"
    },
    "ingredients": {
      "en": [
        "3 yellow onions",
        "2 tbsp butter",
        "4 kale leaves",
        "Marinade",
        "2 tsp finely grated lemon zest",
        "2 cloves garlic, pressed",
        "1/2 dl oil",
        "Salt",
        "Pepper",
        "300 g chicken thigh fillet",
        "1 tbsp oil",
        "1 bag ready-made sourdough pizza dough (400 g each)",
        "1 dl natural cream cheese",
        "1 dl grated parmesan",
        "To serve",
        "1/2 red onion",
        "2 tsp finely grated lemon zest"
      ],
      "zh": [
        "3 个黄洋葱",
        "2 汤匙黄油",
        "4 片羽衣甘蓝叶",
        "腌料",
        "2 茶匙柠檬皮屑（细磨）",
        "2 瓣蒜（压碎）",
        "0.5 分升油",
        "盐",
        "胡椒粉",
        "300 克鸡腿肉",
        "1 汤匙油",
        "1 袋现成酸面包披萨面团（每袋 400 克）",
        "0.5 分升天然奶油奶酪",
        "0.5 分升帕玛森奶酪碎",
        "配料",
        "半个红洋葱",
        "2 茶匙柠檬皮屑（细磨）"
      ],
      "sv": [
        "3 gula lökar",
        "2 msk smör",
        "4 grönkålsblad",
        "Marinad",
        "2 tsk finrivet citronskal",
        "2 pressade vitlöksklyfta",
        "1/2 dl olja",
        "salt",
        "peppar",
        "300 g kycklinglårfilé",
        "1 msk olja",
        "1 påse färdig pizzadeg av surdeg (à 400 g)",
        "1 dl naturell färskost",
        "1 dl riven parmesan",
        "Vid servering",
        "1/2 rödlök",
        "2 tsk finrivet citronskal"
      ]
    },
    "steps": {
      "en": [
        "Peel and slice the onion thinly. Sauté in butter for about 10 minutes until soft. Trim and chop the kale.",
        "Preheat oven to 225°C.",
        "Marinade: Mix lemon zest, garlic and oil, season with salt and pepper. Mix the marinade with the chicken. Leave to marinate for at least 30 minutes in the refrigerator.",
        "Place the chicken in a baking dish and place in the middle of the oven for about 15 minutes. Remove and let cool slightly. Cut into pieces.",
        "Increase oven temperature to 250°C.",
        "Fry the chicken in a hot pan with oil and the kale. Season with salt and pepper.",
        "Cut the pizza dough into 2 equal pieces. Roll out the dough thinly to make two round pizzas and place on a baking sheet lined with baking paper. Mix the cream cheese and parmesan together and spread over the pizza bases. Spread the fried onion over.",
        "Bake in the middle of the oven for about 10 minutes until lightly browned. Remove and add the chicken and the kale. Bake for another 3 minutes.",
        "When serving: Top with thinly sliced ​​red onion and lemon zest. Serve immediately."
      ],
      "zh": [
        "将洋葱去皮切成薄片。用黄油炒约10分钟至软。将羽衣甘蓝切碎。",
        "烤箱预热至225°C。",
        "腌料：将柠檬皮屑、蒜末和油混合，用盐和胡椒粉调味。将腌料与鸡肉混合。放入冰箱腌制至少30分钟。",
        "将鸡肉放入烤盘，置于烤箱中层烤约15分钟。取出稍稍冷却。切成块。",
        "将烤箱温度调至250°C。",
        "在热锅中用油煎鸡肉和羽衣甘蓝。用盐和胡椒粉调味。",
        "将披萨面团分成两等份。将面团擀薄，做成两个圆形披萨饼，放在铺有烘焙纸的烤盘上。将奶油奶酪和帕玛森奶酪混合，涂抹在披萨饼底上。撒上炒好的洋葱。",
        "放入烤箱中层烤约10分钟，直至表面呈金黄色。取出鸡肉和羽衣甘蓝，再烤3分钟。",
        "食用时：撒上切成薄片的红洋葱和柠檬皮屑，趁热享用。"
      ],
      "sv": [
        "Skala och skiva löken tunt. Fräs i smöret ca 10 minuter tills den är mjuk. Ansa och hacka grönkålen.",
        "Sätt ugnen på 225°C.",
        "Marinad: Blanda citronskal, vitlök och olja, smaka av med salt och peppar. Blanda marinaden med kycklingen. Låt marinera minst 30 minuter i kylskåp.",
        "Lägg kycklingen i en ugnsform och ställ in i mitten av ugnen ca 15 minuter. Ta ut och låt svalna lite. Skär i bitar.",
        "Höj ugnstemperaturen till 250°C.",
        "Stek kycklingen i en het panna med olja och grönkålen. Smaka av med med salt och peppar.",
        "Skär pizzadegen i 2 lika stora bitar. Kavla ut degen tunt till två runda pizzor och lägg på en bakpappersklädd plåt. Blanda ihop färskost och parmesan och bred över pizzabottnarna. Fördela den stekta löken över.",
        "Grädda i mitten av ugnen ca 10 minuter tills den får lite färg. Ta ut och lägg på kyckling och grönkålsfräset. Ställ in ytterligare ca 3 minuter.",
        "Vid servering: Toppa gärna med tunt skuren rödlök och citronskal. Servera direkt."
      ]
    },
    "tags": [],
    "cooking_method": {
      "en": "",
      "zh": "",
      "sv": ""
    },
    "tips": {
      "en": "For extra flavor, top the pizza with freshly ground black pepper and flaked salt.",
      "zh": "为了增加风味，可以在披萨上撒上现磨黑胡椒和片状盐。",
      "sv": "För extra smaksättning, toppa pizzan med nymalen svartpeppar och flingsalt."
    },
    "taste_preferences": [
      "salty",
      "rich"
    ],
    "image_url": "/Recipe Image/Europe/EU-FR-006.png"
  },
  {
    "id": "EU-GR-001",
    "region": {
      "en": "Europe",
      "zh": "欧洲",
      "sv": "Europa"
    },
    "subcategory": {
      "en": "Greece",
      "zh": "希腊",
      "sv": "Greece"
    },
    "dish_name": {
      "en": "Moussaka (Simple)",
      "zh": "希腊茄盒（简单）",
      "sv": "Moussaka (Enkel)"
    },
    "description": {
      "en": "A layered eggplant and spiced meat casserole topped with a thick, creamy béchamel sauce, popular in Greece.",
      "zh": "一道在希腊很受欢迎的茄子和香料肉砂锅，上面淋着浓稠的奶油白酱。",
      "sv": "En lager på lager av aubergine och kryddat kött, toppad med en tjock, krämig béchamelsås, populär i Grekland."
    },
    "total_time_min": 30,
    "difficulty": {
      "en": "Easy",
      "zh": "简单",
      "sv": "Lätt"
    },
    "servings": 4,
    "main_type": {
      "en": "Meat",
      "zh": "肉类",
      "sv": "Kött"
    },
    "ingredients": {
      "en": [
        "1 eggplant (approx. 400 g each)",
        "500 g minced meat",
        "1 tsp oil",
        "salt",
        "pepper",
        "1 Dolmio tomato sauce garlic (450 g each)",
        "800 g potato gratin",
        "1 heart lettuce"
      ],
      "zh": [
        "1 个茄子（每个约 400 克）",
        "500 克肉末",
        "1 茶匙油",
        "盐",
        "胡椒粉",
        "1 罐 番茄酱（每罐 450 克）",
        "800 克土豆焗烤",
        "1 颗生菜心"
      ],
      "sv": [
        "1 aubergine (à ca 400 g)",
        "500 g blandfärs",
        "1 tsk olja",
        "salt",
        "peppar",
        "1 Dolmio tomatsås vitlök (à 450 g)",
        "800 g potatisgratäng",
        "1 hjärtsallad"
      ]
    },
    "steps": {
      "en": [
        "Preheat the oven to 225°C.",
        "Cut the eggplant into cubes and fry them and the minced meat in oil in a frying pan. Season with salt and pepper and pour in the tomato sauce. Bring to the boil and place in an oven dish.",
        "Pour the potato gratin over and place the dish in the middle of the oven for about 20 minutes.",
        "Cut the salad into pieces and serve with the moussaka."
      ],
      "zh": [
        "将烤箱预热至225°C。",
        "将茄子切成小块，放入煎锅中用油煎至茄子块和肉末混合。加入盐和胡椒粉调味，倒入番茄酱。煮沸后倒入烤盘。",
        "将土豆焗菜铺在茄子块上，放入烤箱中层烤约20分钟。",
        "将沙拉切成小块，与茄子千层面一起享用。"
      ],
      "sv": [
        "Sätt ugnen på 225°C.",
        "Skär auberginen i tärningar och stek dem och färsen i oljan i en stekpanna. Krydda med salt och peppar och häll i tomatsåsen. Låt koka upp och lägg upp i en ugnsform.",
        "Häll potatisgratängen över och sätt in formen mitt i ugnen ca 20 minuter.",
        "Skär salladen i bitar och servera med moussakan."
      ]
    },
    "tags": [],
    "cooking_method": {
      "en": "",
      "zh": "",
      "sv": ""
    },
    "tips": {
      "en": "Season the minced meat with cayenne pepper and dried rosemary.",
      "zh": "用辣椒粉和干迷迭香给肉馅调味。",
      "sv": "Krydda färsen med cayennepeppar och torkad rosmarin."
    },
    "taste_preferences": [
      "rich",
      "mild",
      "salty"
    ],
    "image_url": "/Recipe Image/Europe/EU-GR-001.png"
  },
  {
    "id": "EU-GR-002",
    "region": {
      "en": "Europe",
      "zh": "欧洲",
      "sv": "Europa"
    },
    "subcategory": {
      "en": "Greece",
      "zh": "希腊",
      "sv": "Greece"
    },
    "dish_name": {
      "en": "Souvlaki",
      "zh": "希腊烤肉串",
      "sv": "Souvlaki"
    },
    "description": {
      "en": "The ultimate Greek street food: skewered, grilled meat marinated in lemon, oil, and herbs.",
      "zh": "希腊街头美食的经典之作：用柠檬、油和香草腌制后串起来烤制的肉串。",
      "sv": "Den ultimata grekiska gatumaten: grillat kött på spett marinerat i citron, olja och örter."
    },
    "total_time_min": null,
    "difficulty": {
      "en": "Medium",
      "zh": "中等",
      "sv": "Medel"
    },
    "servings": 4,
    "main_type": {
      "en": "Meat",
      "zh": "肉类",
      "sv": "Kött"
    },
    "ingredients": {
      "en": [
        "600 g pork fillet or boneless lamb from the roast, for example",
        "1/2 dl olive oil",
        "2 tbsp squeezed lemon juice",
        "1 clove garlic",
        "1 tsp fresh chopped rosemary",
        "2 tsp coarsely ground black pepper",
        "1 tsp salt"
      ],
      "zh": [
        "例如：600克猪里脊肉或烤羊肉（去骨）",
        "0.5分升橄榄油",
        "2汤匙柠檬汁",
        "1瓣蒜",
        "1茶匙新鲜切碎的迷迭香",
        "2茶匙粗磨黑胡椒",
        "1茶匙盐"
      ],
      "sv": [
        "600 g fläskfilé eller benfritt lammkött av t ex steken",
        "1/2 dl olivolja",
        "2 msk pressad citronsaft",
        "1 vitlöksklyfta",
        "1 tsk färsk hackad rosmarin",
        "2 krm grovmald svartpeppar",
        "1 tsk salt"
      ]
    },
    "steps": {
      "en": [
        "Place 8-12 small wooden skewers (for 4 servings) in cold water for about 10 minutes. Trim and cut the meat into small cubes.",
        "Thread the meat tightly onto the skewers. Mix the oil with lemon juice, pressed garlic, rosemary and pepper. Brush the skewers with the marinade and let the skewers marinate in the refrigerator for at least 2 hours.",
        "Grill the skewers on an outdoor grill or in a grill pan, about 8 minutes all around. Salt the skewers.",
        "Serve with wedge potatoes and Greek farmer's salad of tomatoes, cucumber, onion and feta cheese."
      ],
      "zh": [
        "将 8-12 根小木签（4 人份）放入冷水中浸泡约 10 分钟。将肉块修整干净并切成小丁。",
        "将肉丁紧紧地串在木签上。将油、柠檬汁、蒜末、迷迭香和胡椒粉混合。在木签上刷上腌料，放入冰箱腌制至少 2 小时。",
        "将肉串放在户外烧烤架或烤盘上烤制，每面烤约 8 分钟。烤好后撒上盐。",
        "搭配楔形土豆和希腊农夫沙拉（番茄、黄瓜、洋葱和菲达奶酪）一起食用。"
      ],
      "sv": [
        "Lägg 8-12 små spett av trä (för 4 port) i kallt vatten ca 10 min. Putsa och skär köttet i små kuber.",
        "Trä upp köttet tätt på spetten. Blanda oljan med citronsaft, pressad vitlök, rosmarin och peppar. Pensla spetten med marinaden och låt spetten marinera i kylskåpet minst 2 tim.",
        "Grilla spetten på utegrill eller i grillpanna, ca 8 min runt om. Salta spetten.",
        "Servera med klyftpotatis och grekisk bondsallad av tomater, gurka, lök och fetaost."
      ]
    },
    "tags": [],
    "cooking_method": {
      "en": "",
      "zh": "",
      "sv": ""
    },
    "taste_preferences": [
      "salty",
      "rich"
    ],
    "image_url": "/Recipe Image/Europe/EU-GR-002.png"
  },
  {
    "id": "EU-GR-003",
    "region": {
      "en": "Europe",
      "zh": "欧洲",
      "sv": "Europa"
    },
    "subcategory": {
      "en": "Greece",
      "zh": "希腊",
      "sv": "Greece"
    },
    "dish_name": {
      "en": "Greek Salad",
      "zh": "希腊沙拉",
      "sv": "Greek Salad"
    },
    "description": {
      "en": "Greece's famous salad featuring tomatoes, cucumbers, olives, and a large slab of salty feta cheese.",
      "zh": "希腊著名的沙拉，包含西红柿、黄瓜、橄榄和一大块咸香的菲达奶酪",
      "sv": "Greklands berömda sallad med tomater, gurkor, oliver och en stor skiva salt fetaost."
    },
    "total_time_min": 20,
    "difficulty": {
      "en": "Easy",
      "zh": "简单",
      "sv": "Lätt"
    },
    "servings": 4,
    "main_type": {
      "en": "Meat",
      "zh": "肉类",
      "sv": "Kött"
    },
    "ingredients": {
      "en": [
        "Dressing                                                                                                                                                                                                                                                                                                       ¼ cup extra-virgin olive oil",
        "3 tablespoons red wine vinegar",
        "1 garlic clove, minced",
        "½ teaspoon dried oregano, more for sprinkling",
        "¼ teaspoon Dijon mustard",
        "¼ teaspoon sea salt",
        "Freshly ground black pepper",
        "For the salad",
        "1 English cucumber, cut lengthwise, seeded, and sliced ¼-inch thick",
        "1 green bell pepper, chopped into 1-inch pieces",
        "2 cups halved cherry tomatoes",
        "150 g feta cheese, cut into ½ inch cubes*",
        "⅓ cup thinly sliced red onion                                                                                                                                                                                                                                                                  ⅓ cup pitted Kalamata olives",
        "⅓ cup fresh mint leaves"
      ],
      "zh": [
        "沙拉酱：¼ 杯特级初榨橄榄油",
        "3 汤匙红酒醋",
        "1 瓣蒜，切碎",
        "½ 茶匙干牛至，另备一些用于撒在沙拉上",
        "¼ 茶匙第戎芥末酱",
        "¼ 茶匙海盐",
        "现磨黑胡椒",
        "沙拉食材：",
        "1 根英国黄瓜，纵向切开，去籽，切成 ¼ 英寸厚的片",
        "1 个青椒，切成 1 英寸的小块",
        "2 杯对半切开的樱桃番茄",
        "150 克 羊奶酪，切成 ½ 英寸的方块",
        "⅓ 杯切成薄片的红洋葱",
        "⅓ 杯去核的卡拉马塔橄榄",
        "⅓ 杯新鲜薄荷叶"
      ],
      "sv": [
        "Dressning ¼ dl extra jungfruolja",
        "3 msk rödvinsvinäger",
        "1 vitlöksklyfta, hackad",
        "½ tsk torkad oregano, mer att strö över",
        "¼ tsk Dijonsenap",
        "¼ tsk havssalt",
        "Nymalen svartpeppar",
        "Till salladen",
        "1 engelsk gurka, skuren på längden, urkärnad och skivad ¼ cm tjock",
        "1 grön paprika, hackad i 2,5 cm tjocka bitar",
        "2 dl halverade körsbärstomater",
        "150 g fetaost, skuren i 1,2 cm tärningar",
        "⅓ dl tunt skivad rödlök ⅓ dl urkärnade Kalamataoliver",
        "⅓ dl färska myntablad"
      ]
    },
    "steps": {
      "en": [
        "Make the dressing: In a small bowl, whisk together the olive oil, vinegar, garlic, oregano, mustard, salt, and several grinds of pepper.",
        "On a large platter, arrange the cucumber, green pepper, cherry tomatoes, feta cheese, red onions, and olives. Drizzle with the dressing and very gently toss. Sprinkle with a few generous pinches of oregano and top with the mint leaves. Season to taste and serve."
      ],
      "zh": [
        "制作酱汁：在一个小碗中，将橄榄油、醋、大蒜、牛至、芥末、盐和现磨黑胡椒搅拌均匀。",
        "在一个大盘子里，摆放黄瓜、青椒、小番茄、羊奶酪、红洋葱和橄榄。淋上酱汁，轻轻拌匀。撒上几撮牛至，最后放上薄荷叶。根据口味调味即可享用。"
      ],
      "sv": [
        "Gör dressingen: Vispa ihop olivolja, vinäger, vitlök, oregano, senap, salt och lite peppar i en liten skål.",
        "Lägg gurka, grön paprika, körsbärstomater, fetaost, rödlök och oliver på ett stort fat. Ringla över dressingen och blanda försiktigt. Strö över några rejäla nypor oregano och toppa med myntablad. Krydda efter smak och servera."
      ]
    },
    "tags": [],
    "cooking_method": {
      "en": "",
      "zh": "",
      "sv": ""
    },
    "tips": {
      "en": "Feta in brine is best for this recipe.",
      "zh": "用盐水浸泡的F羊乳酪最适合这道菜。",
      "sv": "Feta i saltlake passar bäst till detta recept."
    },
    "taste_preferences": [
      "sour",
      "salty"
    ],
    "image_url": "/Recipe Image/Europe/EU-GR-003.png"
  },
  {
    "id": "EU-GR-004",
    "region": {
      "en": "Europe",
      "zh": "欧洲",
      "sv": "Europa"
    },
    "subcategory": {
      "en": "Greece",
      "zh": "希腊",
      "sv": "Greece"
    },
    "dish_name": {
      "en": "Fava soup with bladderwrack",
      "zh": "蚕豆汤配墨角藻",
      "sv": "Favasoppa med blåstång"
    },
    "description": {
      "en": "Traditional Greek fava soup, offering an unusual but flavorful twist with the nutritious, slightly salty inclusion of bladderwrack.",
      "zh": "传统的希腊蚕豆汤，加入了营养丰富、略带咸味的食材，带来一种不寻常但美味的变化。",
      "sv": "Traditionell grekisk fava-soppa, som erbjuder en ovanlig men smakrik twist med den näringsrika, lätt salta ingrediensen av"
    },
    "total_time_min": null,
    "difficulty": {
      "en": "Easy",
      "zh": "简单",
      "sv": "Lätt"
    },
    "servings": 4,
    "main_type": {
      "en": "Vegetable",
      "zh": "蔬菜/豆类",
      "sv": "Grönsak"
    },
    "ingredients": {
      "en": [
        "4 servings",
        "Soup",
        "1 l vegetable stock",
        "1 tsp allspice",
        "1 tsp white pepper",
        "1 tsp cumin",
        "2 tsp marjoram",
        "1 bay leaf",
        "3 dl dried fava beans",
        "1 tbsp sweet and spicy mustard",
        "1 tbsp butter",
        "To serve",
        "200 g bladderwrack",
        "3 tbsp coarse mustard",
        "white wine vinegar"
      ],
      "zh": [
        "汤",
        "1升蔬菜高汤",
        "1茶匙五香粉",
        "1茶匙白胡椒粉",
        "1茶匙孜然粉",
        "2茶匙马郁兰",
        "1片月桂叶",
        "3分升干蚕豆",
        "1汤匙甜辣芥末酱",
        "1汤匙黄油",
        "佐料",
        "200克墨角藻",
        "3汤匙粗粒芥末酱",
        "白葡萄酒醋"
      ],
      "sv": [
        "Soppa",
        "1 l grönsaksbuljong",
        "1 krm kryddpeppar",
        "1 krm vitpeppar",
        "1 krm kummin",
        "2 krm mejram",
        "1 lagerblad",
        "3 dl torkade favabönor",
        "1 msk sötstark senap",
        "1 msk smör",
        "Till servering",
        "200 g blåstång",
        "3 msk grov senap",
        "vitvinsvinäger"
      ]
    },
    "steps": {
      "en": [
        "Soup: Bring the broth to a boil with the spices. Add the beans and simmer for about 45 minutes. (Add a little extra broth if the soup becomes dry)",
        "Remove from heat and whisk in the mustard and butter.",
        "To serve: Bring 2 liters of salted water to a boil and cook the seaweed for 1 minute. Drain and mix with mustard and season with vinegar.",
        "Divide the soup among four plates and top with the seaweed."
      ],
      "zh": [
        "汤：将高汤和香料一起煮沸。加入豆子，小火慢炖约45分钟。（如果汤太干，可以加少许高汤）",
        "关火，拌入芥末和黄油。",
        "食用方法：将2升盐水煮沸，放入海带煮1分钟。沥干水分，拌入芥末，并用醋调味。",
        "将汤分成四份，盛入盘中，撒上煮好的海带即可。"
      ],
      "sv": [
        "Soppa: Koka upp buljongen med kryddorna. Lägg ner bönorna och låt sjuda i ca 45 minuter. (Tillsätt lite extra buljong om soppan blir torr)",
        "Dra av från värmen och vispa ner senap och smör.",
        "Till servering: Koka upp 2 liter saltat vatten och koka tången i 1 minut. Låt rinna av och blanda med senap och smaka av med vinäger.",
        "Fördela soppan i fyra tallrikar och toppa med tången."
      ]
    },
    "tags": [],
    "cooking_method": {
      "en": "",
      "zh": "",
      "sv": ""
    },
    "taste_preferences": [
      "mild",
      "salty"
    ],
    "image_url": "/Recipe Image/Europe/EU-GR-004.png"
  },
  {
    "id": "EU-GR-005",
    "region": {
      "en": "Europe",
      "zh": "欧洲",
      "sv": "Europa"
    },
    "subcategory": {
      "en": "Greece",
      "zh": "希腊",
      "sv": "Greece"
    },
    "dish_name": {
      "en": "Tzatziki",
      "zh": "希腊酸奶黄瓜酱",
      "sv": "Tzatziki"
    },
    "description": {
      "en": "A refreshing Greek dip made from strained yogurt, cucumber, garlic, and dill.",
      "zh": "一道清爽的希腊蘸酱，由酸奶、黄瓜、大蒜和莳萝制成。",
      "sv": "En uppfriskande grekisk dipp gjord på silad yoghurt, gurka, vitlök och dill."
    },
    "total_time_min": 45,
    "difficulty": {
      "en": "Easy",
      "zh": "简单",
      "sv": "Lätt"
    },
    "servings": 4,
    "main_type": {
      "en": "Vegetable",
      "zh": "蔬菜/豆类",
      "sv": "Grönsak"
    },
    "ingredients": {
      "en": [
        "1/2 cucumber",
        "1/2 tsp salt",
        "2 dl Greek yogurt",
        "1 - 2 large garlic cloves",
        "1 tsp dried or fresh oregano (1 tsp dried equals 2 tbsp fresh)",
        "1 tbsp olive oil",
        "ground black pepper"
      ],
      "zh": [
        "半根黄瓜",
        "半茶匙盐",
        "2分升希腊酸奶",
        "1-2瓣大蒜",
        "1茶匙干牛至或新鲜牛至（1茶匙干牛至相当于2汤匙新鲜牛至）",
        "1汤匙橄榄油",
        "现磨黑胡椒"
      ],
      "sv": [
        "1/2 gurka",
        "1/2 tsk salt",
        "2 dl grekisk yoghurt",
        "1 - 2 stora vitlöksklyftor",
        "1 tsk torkad eller färsk oregano (1 tsk torkad motsvarar 2 msk färsk)",
        "1 msk olivolja",
        "svartpeppar från kvarnen"
      ]
    },
    "steps": {
      "en": [
        "Rinse the cucumber and grate it on the coarse side of a grater. Place in a sieve and mix with salt. Let drain for 30 minutes. Squeeze out the liquid with your hand.",
        "Stir together the yogurt, pressed garlic, cucumber zest, oregano and olive oil. Season with black pepper"
      ],
      "zh": [
        "将黄瓜洗净，用粗孔擦丝器擦成丝。放入筛子中，加盐拌匀。静置沥水30分钟。用手挤出多余的水分。",
        "将酸奶、蒜泥、黄瓜丝、牛至和橄榄油搅拌均匀。撒上黑胡椒粉调味。"
      ],
      "sv": [
        "Skölj gurkan och riv den på grövsta sidan på ett rivjärn. Lägg i en sil och blanda i  salt. Låt rinna av i 30 minuter. Krama ur vätskan med handen.",
        "Rör ihop yoghurt, pressad vitlök, gurkrasp, oregano och olivolja. Smaksätt med svartpeppar"
      ]
    },
    "tags": [],
    "cooking_method": {
      "en": "",
      "zh": "",
      "sv": ""
    },
    "taste_preferences": [
      "mild",
      "sour"
    ],
    "image_url": "/Recipe Image/Europe/EU-GR-005.png"
  },
  {
    "id": "EU-GR-006",
    "region": {
      "en": "Europe",
      "zh": "欧洲",
      "sv": "Europa"
    },
    "subcategory": {
      "en": "Greece",
      "zh": "希腊",
      "sv": "Greece"
    },
    "dish_name": {
      "en": "Stifado",
      "zh": "希腊炖牛肉",
      "sv": "Stifado"
    },
    "description": {
      "en": "A hearty Greek beef stew characterized by small pearl onions, tomato, red wine, and cinnamon.",
      "zh": "一道丰盛的希腊炖牛肉，以小珍珠洋葱、番茄、红酒和肉桂为特色。",
      "sv": "En rejäl grekisk nötköttsgryta som kännetecknas av små pärllökar, tomat, rödvin och kanel."
    },
    "total_time_min": null,
    "difficulty": {
      "en": "Medium",
      "zh": "中等",
      "sv": "Medel"
    },
    "servings": 4,
    "main_type": {
      "en": "Meat",
      "zh": "肉类",
      "sv": "Kött"
    },
    "ingredients": {
      "en": [
        "3 yellow onions",
        "3 garlic cloves",
        "800 g prime rib",
        "1 tbsp rapeseed oil",
        "500 g crushed tomatoes",
        "2 meat bouillon cubes",
        "1 tsp granulated sugar",
        "1 tbsp red wine vinegar",
        "3 tsp dried oregano",
        "2 bay leaves",
        "1 cinnamon stick",
        "2 tsp ground cloves",
        "1 dl pickled onions",
        "salt",
        "black pepper",
        "To serve",
        "potatoes",
        "green beans"
      ],
      "zh": [
        "3 个黄洋葱",
        "3 瓣大蒜",
        "800 克上等肋眼牛排",
        "1 汤匙菜籽油",
        "500 克碎番茄",
        "2 块肉汤块",
        "1 茶匙砂糖",
        "1 汤匙红酒醋",
        "3 茶匙干牛至",
        "2 片月桂叶",
        "1 根肉桂棒",
        "2 茶匙丁香粉",
        "1 分升腌洋葱",
        "盐",
        "黑胡椒",
        "配菜",
        "土豆",
        "四季豆"
      ],
      "sv": [
        "3 gula lökar",
        "3 vitlöksklyftor",
        "800 g högrev",
        "1 msk rapsolja",
        "500 g krossade tomater",
        "2 köttbuljongtärningar",
        "1 tsk strösocker",
        "1 msk rödvinsvinäger",
        "3 tsk torkad oregano",
        "2 lagerblad",
        "1 kanelstång",
        "2 krm mald nejlika",
        "1 dl syltlök",
        "salt",
        "svartpeppar",
        "Till servering",
        "potatis",
        "haricots verts (bönor)"
      ]
    },
    "steps": {
      "en": [
        "Peel the onion and cut it into pieces and finely chop the garlic.",
        "Cut the meat into pieces about 3 x 3 cm and brown them in oil in a pot. Add the onion and garlic and fry for a while. Pour in crushed tomatoes and water so that it covers the meat. Then add crumbled stock cubes, sugar, red wine vinegar, oregano, bay leaves, cinnamon stick and ground cloves. Bring to the boil and skim off the fat and waste products. Cook slowly for about 2 hours, or until the meat is tender.",
        "Add drained pickled onions and season with salt and pepper.",
        "Serve the stew with boiled or oven-roasted potatoes and green beans."
      ],
      "zh": [
        "洋葱去皮切块，大蒜切碎。",
        "将肉切成约 3 x 3 厘米的小块，放入锅中用油煎至表面金黄。加入洋葱和大蒜，翻炒片刻。倒入番茄碎和水，水量以没过肉块为宜。然后加入捏碎的浓汤宝、糖、红酒醋、牛至、月桂叶、肉桂棒和丁香粉。煮沸后撇去浮沫和杂质。小火慢炖约 2 小时，或直至肉质软烂。",
        "加入沥干水分的腌洋葱，并用盐和胡椒粉调味。",
        "将炖菜与煮土豆或烤土豆和四季豆一起享用。"
      ],
      "sv": [
        "Skala löken och skär den i bitar och finhacka vitlöken.",
        "Skär köttet i ca 3 x 3 cm stora bitar och bryn dem i olja i en gryta. Tillsätt lök och vitlök och fräs med ett tag. Häll i krossade tomater och vatten så att det täcker köttet. Tillsätt därefter smulade buljongtärningar, socker, rödvinsvinäger, oregano, lagerblad, kanelstång och mald nejlika. Koka upp och skumma av fett och slaggprodukter. Koka sakta i ca 2 timmar, eller tills köttet är mört.",
        "Lägg i avrunnen syltlök och krydda med salt och peppar.",
        "Servera grytan med kokt eller ugnsrostad potatis och haricots verts."
      ]
    },
    "tags": [],
    "cooking_method": {
      "en": "",
      "zh": "",
      "sv": ""
    },
    "tips": {
      "en": "Eat tzatziki with the stew!",
      "zh": "炖菜配酸奶黄瓜酱吃！",
      "sv": "Ät tzatziki till grytan!"
    },
    "taste_preferences": [
      "rich",
      "sweet",
      "sour"
    ],
    "image_url": "/Recipe Image/Europe/EU-GR-006.png"
  },
  {
    "id": "EU-GR-007",
    "region": {
      "en": "Europe",
      "zh": "欧洲",
      "sv": "Europa"
    },
    "subcategory": {
      "en": "Greece",
      "zh": "希腊",
      "sv": "Greece"
    },
    "dish_name": {
      "en": "Melitzanosalata or Greek Eggplant Dip",
      "zh": "希腊烤茄子沙拉酱",
      "sv": "Melitzanosalata – auberginesallad"
    },
    "description": {
      "en": "A smoky Greek eggplant dip made from grilled or roasted eggplant, olive oil, and lemon juice.",
      "zh": "一道带有烟熏风味的希腊茄子蘸酱，由烤茄子、橄榄油和柠檬汁制成。",
      "sv": "En rökig grekisk auberginedipp gjord på grillad eller rostad aubergine, olivolja och citronsaft."
    },
    "total_time_min": 45,
    "difficulty": {
      "en": "Medium",
      "zh": "中等",
      "sv": "Medel"
    },
    "servings": 4,
    "main_type": {
      "en": "Vegetable",
      "zh": "蔬菜/豆类",
      "sv": "Grönsak"
    },
    "ingredients": {
      "en": [
        "1 large eggplant (approx. 400 g each)",
        "1 grated garlic clove",
        "1 tbsp olive oil",
        "1 tbsp finely grated lemon zest",
        "1 tbsp freshly squeezed lemon juice",
        "1 - 2 dl chopped parsley",
        "flaked salt",
        "black pepper",
        "optional olives"
      ],
      "zh": [
        "1个大茄子（每个约400克）",
        "1瓣蒜（磨碎）",
        "1汤匙橄榄油",
        "1汤匙柠檬皮屑",
        "1汤匙鲜榨柠檬汁",
        "1-2分升切碎的欧芹",
        "片状盐",
        "黑胡椒",
        "可选：橄榄"
      ],
      "sv": [
        "1 stor aubergine (à ca 400 g)",
        "1 riven vitlöksklyfta",
        "1 msk olivolja",
        "1 msk finrivet citronskal",
        "1 msk färskpressad citronjuice",
        "1 - 2 dl hackad persilja",
        "flingsalt",
        "svartpeppar",
        "ev oliver"
      ]
    },
    "steps": {
      "en": [
        "Grill the eggplant until soft inside or bake in the oven at 225°C grill/top heat for 15–20 minutes. Turn occasionally. Let cool slightly.",
        "Peel and chop the eggplant. Mix with garlic, oil, lemon zest and juice. Stir in the parsley. Season with salt and pepper.",
        "Place in a bowl or plate and garnish with olives."
      ],
      "zh": [
        "将茄子烤至内部软烂，或放入预热至225°C的烤箱中烤15-20分钟（使用烤架/上火）。期间偶尔翻面。稍稍放凉。",
        "将茄子去皮切块。与蒜末、橄榄油、柠檬皮屑和柠檬汁混合。拌入欧芹碎。用盐和胡椒粉调味。",
        "盛入碗或盘中，用橄榄装饰即可。"
      ],
      "sv": [
        "Grilla auberginen tills den är mjuk inuti eller baka i ugnen på 225 °C grill/övervärme 15–20 minuter. Vänd då och då. Låt svalna lite.",
        "Skala och hacka auberginen. Blanda med vitlök, olja, citronskal och -juice. Rör ner persiljan. Smaka av med salt och peppar.",
        "Lägg i en skål eller tallrik och garnera gärna med oliver."
      ]
    },
    "tags": [],
    "cooking_method": {
      "en": "",
      "zh": "",
      "sv": ""
    },
    "tips": {
      "en": "Serve the eggplant salad with a piece of bread.",
      "zh": "将茄子沙拉配上一片面包一起食用。",
      "sv": "Servera gärna aubergine-salladen med en bit bröd."
    },
    "taste_preferences": [
      "mild",
      "salty",
      "rich"
    ],
    "image_url": "/Recipe Image/Europe/EU-GR-007.png"
  },
  {
    "id": "EU-GR-008",
    "region": {
      "en": "Europe",
      "zh": "欧洲",
      "sv": "Europa"
    },
    "subcategory": {
      "en": "Greece",
      "zh": "希腊",
      "sv": "Greece"
    },
    "dish_name": {
      "en": "Giouvetsi",
      "zh": "希腊肉酱意面焗饭",
      "sv": "Giouvetsi – risonigratäng med grytbitar"
    },
    "description": {
      "en": "A classic Greek comfort dish of baked beef or lamb stew combined with small orzo-shaped pasta (risoni).",
      "zh": "一道经典的希腊家常菜，由烤牛肉或羊肉炖菜与小米粒状的意大利面组成。",
      "sv": "En klassisk grekisk husmanskosträtt med ugnsbakad nöt- eller lammgryta kombinerad med liten orzoformad pasta (risoni)."
    },
    "total_time_min": null,
    "difficulty": {
      "en": "Medium",
      "zh": "中等",
      "sv": "Medel"
    },
    "servings": 4,
    "main_type": {
      "en": "Meat",
      "zh": "肉类",
      "sv": "Kött"
    },
    "ingredients": {
      "en": [
        "2 yellow onions",
        "3 garlic cloves",
        "2 carrots",
        "800 g lamb or beef stew pieces",
        "2 tbsp oil",
        "2 tbsp tomato paste",
        "1 dl red wine",
        "1 pack crushed tomatoes (390 g each)",
        "1 l water",
        "1 stock cube",
        "2 bay leaves",
        "1 cinnamon stick",
        "2 1/2 dl uncooked risoni pasta",
        "1 dl chopped parsley (+ extra for serving)",
        "1 tsp salt",
        "2 tsp black pepper",
        "optional salt flakes"
      ],
      "zh": [
        "2 个黄洋葱",
        "3 瓣大蒜",
        "2 根胡萝卜",
        "800 克羊肉或牛肉炖块",
        "2 汤匙油",
        "2 汤匙番茄酱",
        "1 分升红酒",
        "1 包碎番茄（每包 390 克）",
        "1 升水",
        "1 块浓汤宝",
        "2 片月桂叶",
        "1.5 分升生意大利米形面",
        "1 分升切碎的欧芹（另备一些用于装饰）",
        "1 茶匙盐",
        "2 茶匙黑胡椒",
        "可选：海盐片"
      ],
      "sv": [
        "2 gula lökar",
        "3 vitlöksklyftor",
        "2 morötter",
        "800 g grytbitar av lamm eller nöt",
        "2 msk olja",
        "2 msk tomatpuré",
        "1 dl rött vin",
        "1 förp krossade tomater (à 390 g)",
        "1 l vatten",
        "1 buljongtärning",
        "2 lagerblad",
        "1 kanelstång",
        "2 1/2 dl okokt risonipasta",
        "1 dl hackad persilja (+ extra till servering)",
        "1 tsk salt",
        "2 krm svartpeppar",
        "ev flingsalt"
      ]
    },
    "steps": {
      "en": [
        "Peel and chop the onion and garlic. Peel and slice the carrot.",
        "Fry the meat in the oil in a pot that has a lid and can stand in the oven, until it gets a little color. Add the onion, garlic and tomato paste and fry for a few more minutes. Add the carrot, wine, crushed tomatoes, water, stock cube, bay leaf and cinnamon stick. Cook covered until the meat is tender, 1½–2 hours. Remove the cinnamon stick.",
        "Set the oven to 200°C.",
        "Add the uncooked risoni, parsley, salt and pepper. Place the pot in the middle of the oven (without a lid) for about 20 minutes. Let stand for about 20 minutes before serving. Place on a serving platter and top with parsley and, if desired, flaked salt."
      ],
      "zh": [
        "将洋葱和大蒜去皮切碎。胡萝卜去皮切片。",
        "在带盖且可放入烤箱的锅中，用油煎肉，直至略微上色。加入洋葱、大蒜和番茄酱，继续翻炒几分钟。加入胡萝卜、葡萄酒、番茄碎、水、浓汤宝、香叶和肉桂棒。盖上锅盖，炖煮1.5-2小时，直至肉质软烂。取出肉桂棒。",
        "将烤箱预热至200°C。",
        "加入生米粉、欧芹、盐和胡椒粉。将锅放入烤箱中层（无需盖盖），烤约20分钟。出炉后静置约20分钟即可食用。盛入盘中，撒上欧芹碎，如果喜欢，还可以撒上一些片状海盐。"
      ],
      "sv": [
        "Skala och hacka lök och vitlök. Skala och skiva moroten.",
        "Fräs köttet i oljan i en gryta, som har lock och tål att stå i ugnen, tills det får lite färg. Tillsätt lök, vitlök och tomatpuré och fräs ytterligare några minuter. Tillsätt morot, vin, krossade tomater, vatten, buljongtärning, lagerblad och kanelstång. Låt koka under lock tills köttet är mört 1 ½–2 timmar. Lyft upp kanelstången.",
        "Sätt ugnen på 200°C.",
        "Tillsätt okokt risoni, persilja, salt och peppar. Ställ in grytan i mitten av ugnen (utan lock) ca 20 minuter. Låt stå ca 20 minuter innan servering. Lägg upp på ett serveringsfat och toppa med persilja och gärna flingsalt."
      ]
    },
    "tags": [],
    "cooking_method": {
      "en": "",
      "zh": "",
      "sv": ""
    },
    "taste_preferences": [
      "rich",
      "salty"
    ],
    "image_url": "/Recipe Image/Europe/EU-GR-008.png"
  },
  {
    "id": "EU-SW-001",
    "region": {
      "en": "Europe",
      "zh": "欧洲",
      "sv": "Europa"
    },
    "subcategory": {
      "en": "Sweden",
      "zh": "瑞典",
      "sv": "Sweden"
    },
    "dish_name": {
      "en": "Swedish Meatballs",
      "zh": "瑞典肉丸",
      "sv": "Svenska köttbullar"
    },
    "description": {
      "en": "Sweden's national dish, traditionally served with cream sauce, mashed potatoes, and lingonberry jam.",
      "zh": "瑞典国菜，传统上配以奶油酱、土豆泥和越橘果酱。",
      "sv": "Sveriges nationalrätt, traditionellt serverad med gräddsås, potatismos och lingonsylt."
    },
    "total_time_min": 30,
    "difficulty": {
      "en": "Medium",
      "zh": "中等",
      "sv": "Medel"
    },
    "servings": 4,
    "main_type": {
      "en": "Meat",
      "zh": "肉类",
      "sv": "Kött"
    },
    "ingredients": {
      "en": [
        "1 1/2 dl milk",
        "5 tbsp breadcrumbs",
        "500 g ground beef or mixed meat",
        "1/2 yellow onion (peeled and grated)",
        "1 egg",
        "1 tsp salt",
        "1 tsp pepper",
        "1/2 tsp sugar",
        "butter or margarine"
      ],
      "zh": [
        "1.5分升牛奶",
        "5汤匙面包屑",
        "500克牛肉末或混合肉末",
        "半个黄洋葱（去皮擦丝）",
        "1个鸡蛋",
        "1茶匙盐",
        "1茶匙胡椒粉",
        "半茶匙糖",
        "黄油或人造黄油"
      ],
      "sv": [
        "1 1/2 dl mjölk",
        "5 msk ströbröd",
        "500 g nöt- eller blandfärs",
        "1/2 gul lök (skalad och riven)",
        "1 ägg",
        "1 tsk salt",
        "1 krm peppar",
        "1/2 tsk socker",
        "smör eller margarin"
      ]
    },
    "steps": {
      "en": [
        "Mix milk and breadcrumbs. Let swell for 10 minutes. Add minced meat, onion, egg, salt, pepper and sugar to the breadcrumb mixture. Work the minced meat together thoroughly.",
        "Wet your hands with cold water and form meatballs. Fry a few at a time in cooking fat, shaking the pan from time to time so that the meatballs roll around and stay round.",
        "Serving suggestion: Serve the meatballs with boiled potatoes or mashed potatoes, lingonberry jam and pickled cucumber."
      ],
      "zh": [
        "将牛奶和面包屑混合，静置10分钟使其膨胀。将肉末、洋葱、鸡蛋、盐、胡椒粉和糖加入面包屑混合物中，充分揉搓均匀。",
        "将双手沾湿，捏成肉丸。每次放入少量肉丸，用食用油煎炸，并不时晃动锅子，使肉丸翻滚并保持圆形。",
        "食用建议：肉丸可搭配煮土豆或土豆泥、越橘果酱和腌黄瓜。"
      ],
      "sv": [
        "Blanda mjölk och ströbröd. Låt svälla i 10 minuter. Tillsätt färs, lök, ägg, salt, peppar och socker i ströbrödsblandningen. Arbeta ihop färsen ordentligt.",
        "Fukta händerna med kallt vatten och forma köttbullar. Stek några i taget i matfett, skaka pannan då och då så att köttbullarna rullar runt och håller sig runda.",
        "Serveringsförslag: Servera köttbullarna med kokt potatis eller Potatismos , Lingonsylt och Pressgurka."
      ]
    },
    "tags": [],
    "cooking_method": {
      "en": "",
      "zh": "",
      "sv": ""
    },
    "taste_preferences": [
      "mild",
      "rich",
      "salty"
    ],
    "image_url": "/Recipe Image/Europe/EU-SW-001.png"
  },
  {
    "id": "EU-SW-002",
    "region": {
      "en": "Europe",
      "zh": "欧洲",
      "sv": "Europa"
    },
    "subcategory": {
      "en": "Sweden",
      "zh": "瑞典",
      "sv": "Sweden"
    },
    "dish_name": {
      "en": "Hot tuna melt",
      "zh": "热金枪鱼三明治",
      "sv": "Varm tonfisksmälta"
    },
    "description": {
      "en": "A warm American sandwich made with canned tuna, mayonnaise, and melted cheese.",
      "zh": "美式热三明治，用罐装金枪鱼、蛋黄酱和融化的奶酪制成。",
      "sv": "En varm amerikansk smörgås gjord på tonfisk på burk, majonnäs och smält ost."
    },
    "total_time_min": 15,
    "difficulty": {
      "en": "Easy",
      "zh": "简单",
      "sv": "Lätt"
    },
    "servings": 4,
    "main_type": {
      "en": "Seafood",
      "zh": "海鲜",
      "sv": "Skaldjur"
    },
    "ingredients": {
      "en": [
        "2 - 3 tbsp chopped pickled jalapeño",
        "1 celery stalk",
        "4 pickles",
        "2 cans tuna in water (approx. 170 g each)",
        "1 dl mayonnaise",
        "salt",
        "12 slices cheddar cheese",
        "8 slices sourdough bread",
        "approx. 2 tbsp butter"
      ],
      "zh": [
        "2-3 汤匙切碎的腌墨西哥辣椒",
        "1 根芹菜",
        "4 根酸黄瓜",
        "2 罐水浸金枪鱼（每罐约 170 克）",
        "1 分升蛋黄酱",
        "盐",
        "12 片切达奶酪",
        "8 片酸面包",
        "约 2 汤匙黄油"
      ],
      "sv": [
        "2 - 3 msk hackad inlagd jalapeño",
        "1 selleristjälk",
        "4 saltgurkor",
        "2 förp tonfisk i vatten (à ca 170 g)",
        "1 dl majonnäs",
        "salt",
        "12 skivor cheddarost",
        "8 skivor surdegsbröd",
        "ca 2 msk smör"
      ]
    },
    "steps": {
      "en": [
        "Finely chop the jalapeño and celery stalk. Slice the pickle. Drain the tuna and squeeze out some of the water.",
        "Mix the tuna with the mayonnaise, jalapeño and celery. Season with salt.",
        "Spread the cheese on half of the bread slices. Top with the mixture, sliced ​​pickle and finish with the remaining bread slices.",
        "Fry in butter until golden brown and the cheese has melted."
      ],
      "zh": [
        "将墨西哥辣椒和芹菜茎切碎。将酸黄瓜切片。沥干金枪鱼罐头中的水分，并挤出少许水分。",
        "将金枪鱼与蛋黄酱、墨西哥辣椒和芹菜混合。加盐调味。",
        "在半数面包片上涂抹奶酪。放上混合物，铺上酸黄瓜片，最后盖上剩余的面包片。",
        "用黄油煎至金黄色，奶酪融化即可。"
      ],
      "sv": [
        "Finhacka jalapeñon och selleristjälken. Skiva saltgurkan. Häll av tonfisken och pressa ur lite vatten.",
        "Blanda ihop tonfisken med majonnäs, jalapeño och selleri. Smaka av med salt.",
        "Fördela osten på hälften av brödskivorna. Lägg på röran, skivad saltgurka och avsluta med de resterande brödskivorna.",
        "Stek gyllene i smör tills osten smält."
      ]
    },
    "tags": [],
    "cooking_method": {
      "en": "",
      "zh": "",
      "sv": ""
    },
    "taste_preferences": [
      "salty",
      "rich",
      "mild"
    ],
    "image_url": "/Recipe Image/Europe/EU-SW-002.png"
  },
  {
    "id": "EU-SW-003",
    "region": {
      "en": "Europe",
      "zh": "欧洲",
      "sv": "Europa"
    },
    "subcategory": {
      "en": "Sweden",
      "zh": "瑞典",
      "sv": "Sweden"
    },
    "dish_name": {
      "en": "Cheese and ham pie",
      "zh": "奶酪火腿派",
      "sv": "Ost och skinkpaj"
    },
    "description": {
      "en": "A simple, savory pie or quiche filled with cooked ham and melted cheese.",
      "zh": "一种简单的咸味馅饼或乳蛋饼，馅料为熟火腿和融化的奶酪。",
      "sv": "En enkel, smakrik paj eller quiche fylld med kokt skinka och smält ost."
    },
    "total_time_min": null,
    "difficulty": {
      "en": "Medium",
      "zh": "中等",
      "sv": "Medel"
    },
    "servings": 4,
    "main_type": {
      "en": "Meat",
      "zh": "肉类",
      "sv": "Kött"
    },
    "ingredients": {
      "en": [
        "3 dl wheat flour",
        "100 g margarine or butter",
        "3 tbsp cold water",
        "120 g smoked or cooked ham",
        "150 g grated cheese",
        "3 eggs",
        "3 dl milk",
        "1/2 tsp salt",
        "1 pinch pepper",
        "1/2 tsp paprika"
      ],
      "zh": [
        "3分升小麦粉",
        "100克人造黄油或黄油",
        "3汤匙冷水",
        "120克烟熏或熟火腿",
        "150克磨碎的奶酪",
        "3个鸡蛋",
        "3分升牛奶",
        "1/2茶匙盐",
        "少许胡椒粉",
        "1/2茶匙辣椒粉"
      ],
      "sv": [
        "3 dl vetemjöl",
        "100 g margarin eller smör",
        "3 msk kallt vatten",
        "120 g rökt eller kokt skinka",
        "150 g riven ost",
        "3 ägg",
        "3 dl mjölk",
        "1/2 tsk salt",
        "1 krm peppar",
        "1/2 tsk paprikapulver"
      ]
    },
    "steps": {
      "en": [
        "Finely chop the shortening into the flour until it forms a crumbly mass. Add the water and work quickly into a dough.",
        "Press or roll out the dough into a pie pan about 25 cm in diameter. Prick the bottom with a fork. Leave it in the refrigerator for about 30 minutes. Set the oven to 225°C.",
        "Cut the ham into strips. Whisk together the eggs, milk and spices.",
        "Pre-bake the pie crust in the middle of the oven for about 10 minutes. Reduce the heat to 200°C.",
        "Place the ham and cheese in the pie pan. Pour over the egg mixture.",
        "Bake the pie in the middle of the oven for about 25 minutes or until the egg mixture has set. To serve: Serve the pie with a tomato salad."
      ],
      "zh": [
        "将起酥油切碎拌入面粉中，直至形成松散的碎屑状。加入水，快速揉成面团。",
        "将面团擀开或压入直径约25厘米的派盘中。用叉子在派盘底部戳一些小孔。放入冰箱冷藏约30分钟。烤箱预热至225摄氏度。",
        "将火腿切成条状。将鸡蛋、牛奶和香料搅拌均匀。",
        "将派皮放入烤箱中层预烤约10分钟。将烤箱温度调至200摄氏度。",
        "将火腿和奶酪放入派盘中。倒入蛋液。",
        "将派放入烤箱中层烘烤约25分钟，或直至蛋液凝固。食用方法：搭配番茄沙拉享用。"
      ],
      "sv": [
        "Finfördela matfettet i mjölet till en grynig massa. Tillsätt vattnet och arbeta snabbt ihop till en deg.",
        "Tryck eller kavla ut degen i en pajform ca 25 cm i diameter. Nagga bottnen med en gaffel. Låt det stå i kylskåp ca 30 minuter. Sätt ugnen på 225°C.",
        "Skär skinkan i strimlor. Vispa ihop ägg, mjölk och kryddor.",
        "Förgrädda pajskalet mitt i ugnen ca 10 minuter. Sänk värmen till 200°C.",
        "Lägg skinka och ost i pajformen. Häll över äggstanningen.",
        "Grädda pajen mitt i ugnen ca  25 minuter eller tills äggstanningen stannat.                                                                                                                                                                                                               Till servering: Servera pajen med en tomatsallad."
      ]
    },
    "tags": [],
    "cooking_method": {
      "en": "",
      "zh": "",
      "sv": ""
    },
    "taste_preferences": [
      "rich",
      "salty"
    ],
    "image_url": "/Recipe Image/Europe/EU-SW-003.png"
  },
  {
    "id": "EU-SW-004",
    "region": {
      "en": "Europe",
      "zh": "欧洲",
      "sv": "Europa"
    },
    "subcategory": {
      "en": "Sweden",
      "zh": "瑞典",
      "sv": "Sweden"
    },
    "dish_name": {
      "en": "Toast Skagen",
      "zh": "瑞典鲜虾吐司",
      "sv": "Toast Skagen"
    },
    "description": {
      "en": "A Swedish classic appetizer: toasted bread topped with a creamy mix of shrimp, mayonnaise, and dill.",
      "zh": "瑞典经典开胃菜：烤面包上涂抹着由虾仁、蛋黄酱和莳萝混合而成的奶油酱。",
      "sv": "En klassisk svensk förrätt: rostat bröd toppat med en krämig blandning av räkor, majonnäs och dill."
    },
    "total_time_min": 19,
    "difficulty": {
      "en": "Easy",
      "zh": "简单",
      "sv": "Lätt"
    },
    "servings": 6,
    "main_type": {
      "en": "Seafood",
      "zh": "海鲜",
      "sv": "Skaldjur"
    },
    "ingredients": {
      "en": [
        "1 pack of shrimp in brine (580 g each)",
        "1 jar of dill",
        "1 1/2 dl mayonnaise",
        "1 dl crème fraiche",
        "salt",
        "black pepper",
        "1/2 lemon (juice)"
      ],
      "zh": [
        "1 包盐水虾（每只 580 克）",
        "1 罐莳萝",
        "1.5 分升蛋黄酱",
        "1 分升法式酸奶油",
        "盐",
        "黑胡椒",
        "半个柠檬（汁）"
      ],
      "sv": [
        "1 förp räkor i lake (à 580 g)",
        "1 kruka dill",
        "1 1/2 dl majonnäs",
        "1 dl crème fraiche",
        "salt",
        "svartpeppar",
        "1/2 citron (saft)"
      ]
    },
    "steps": {
      "en": [
        "Drain the shrimp in a sieve.",
        "Chop the dill. Mix the dill, mayonnaise and crème fraiche.",
        "Squeeze out more layers from the shrimp and mix them into the sauce.",
        "Season with salt and pepper and a few drops of lemon juice.",
        "Serving suggestion: Put the mixture on fried bread, with chips or vegetable sticks, in baked potatoes, avocado halves. Serve with lemon wedges and garnish with a few dill sprigs. buttered fried bread chips, vegetables, baked potatoes or avocado.",
        "dill sprigs and lemon wedges"
      ],
      "zh": [
        "将虾仁沥干水分。",
        "将莳萝切碎。将莳萝、蛋黄酱和法式酸奶油混合。",
        "挤出虾仁的更多筋膜，拌入酱汁中。",
        "用盐、胡椒粉和几滴柠檬汁调味。",
        "食用建议：将混合物涂抹在炸面包片上，搭配薯片或蔬菜条，或夹在烤土豆、牛油果中。佐以柠檬角和几枝莳萝装饰。",
        "搭配黄油炸面包片、蔬菜、烤土豆或牛油果。",
        "莳萝枝和柠檬角"
      ],
      "sv": [
        "Drain the shrimp in a sieve.",
        "Chop the dill. Mix the dill, mayonnaise and crème fraiche.",
        "Squeeze out more layers from the shrimp and mix them into the sauce.",
        "Season with salt and pepper and a few drops of lemon juice.",
        "Serving suggestion: Put the mixture on fried bread, with chips or vegetable sticks, in baked potatoes, avocado halves. Serve with lemon wedges and garnish with a few dill sprigs. buttered fried bread chips, vegetables, baked potatoes or avocado.",
        "dill sprigs and lemon wedges"
      ]
    },
    "tags": [],
    "cooking_method": {
      "en": "",
      "zh": "",
      "sv": ""
    },
    "taste_preferences": [
      "rich",
      "salty",
      "mild"
    ],
    "image_url": "/Recipe Image/Europe/EU-SW-004.png"
  },
  {
    "id": "EU-SW-005",
    "region": {
      "en": "Europe",
      "zh": "欧洲",
      "sv": "Europa"
    },
    "subcategory": {
      "en": "Sweden",
      "zh": "瑞典",
      "sv": "Sweden"
    },
    "dish_name": {
      "en": "Beef Bourguignon with Mashed Potatoes",
      "zh": "勃艮第红酒炖牛肉配土豆泥",
      "sv": "Boeuf bourguignon med potatismos"
    },
    "description": {
      "en": "The hearty stew with prime rib, red wine, pork belly, onion, mushroom and carrot is served with creamy mashed potatoes with lemon and garlic.",
      "zh": "这道丰盛的炖菜用上等牛肋排、红酒、五花肉、洋葱、蘑菇和胡萝卜烹制而成，配以柠檬蒜香奶油土豆泥。",
      "sv": "Den mustiga grytan med högrev, rött vin, sidfläsk, lök, champinjon och morot serveras med krämigt potatismos med citron och vitlök."
    },
    "total_time_min": null,
    "difficulty": {
      "en": "Medium",
      "zh": "中等",
      "sv": "Medel"
    },
    "servings": 6,
    "main_type": {
      "en": "Meat",
      "zh": "肉类",
      "sv": "Kött"
    },
    "ingredients": {
      "en": [
        "1 kg of prime rib, cut into pieces",
        "200 g of smoked pork belly",
        "2 shallots",
        "3 cloves of garlic",
        "3 carrots (each approx. 70 g)",
        "1 1/2 tbsp tomato paste",
        "4 tbsp butter",
        "1 1/2 dl water",
        "2 tbsp wheat flour",
        "5 dl red wine",
        "2 tbsp concentrated veal stock",
        "1 tbsp soy sauce",
        "2 sprigs of thyme or dried thyme (2 sprigs equal 1/2 tsp dried)",
        "3 bay leaves",
        "salt",
        "black pepper",
        "Mashed potatoes",
        "1 kg of potatoes",
        "1 grated clove of garlic",
        "25 g of butter",
        "1 dl whipping cream",
        "2 dl milk (3%)",
        "1 tsp finely grated lemon zest",
        "Mushroom slicer",
        "250 g of fried onions (preferably red)",
        "400 g of fresh mushrooms",
        "2 tbsp butter"
      ],
      "zh": [
        "1公斤上等肋眼牛排，切块",
        "200克烟熏五花肉",
        "2个小洋葱",
        "3瓣大蒜",
        "3根胡萝卜（每根约70克）",
        "1.5汤匙番茄酱",
        "4汤匙黄油",
        "1.5分升水",
        "2汤匙小麦粉",
        "5分升红酒",
        "2汤匙浓缩小牛肉汤",
        "1汤匙酱油",
        "2枝新鲜百里香或干百里香（2枝相当于1/2茶匙干百里香）",
        "3片月桂叶",
        "盐",
        "黑胡椒",
        "土豆泥",
        "1公斤土豆",
        "1瓣大蒜，磨碎",
        "25克黄油",
        "1分升鲜奶油",
        "2分升牛奶（3%）",
        "1茶匙柠檬皮屑",
        "蘑菇切片器",
        "250克炸洋葱（最好是红洋葱）",
        "400克新鲜蘑菇",
        "2汤匙黄油"
      ],
      "sv": [
        "1 kg högrev i bit",
        "200 g rökt sidfläsk",
        "2 schalottenlökar",
        "3 vitlöksklyftor",
        "3 morötter (à ca 70 g)",
        "1 1/2 msk tomatpuré",
        "4 msk smör",
        "1 1/2 dl vatten",
        "2 msk vetemjöl",
        "5 dl rödvin",
        "2 msk konc kalvfond",
        "1 msk soja",
        "2 timjankvistar eller torkad timjan (2 kvistar motsvarar 1/2 tsk torkad)",
        "3 lagerblad",
        "salt",
        "svartpeppar",
        "Potatismos",
        "1 kg potatis",
        "1 riven vitlöksklyfta",
        "25 g smör",
        "1 dl vispgrädde",
        "2 dl mjölk (3%)",
        "1 tsk finrivet citronskal",
        "Svampfräs",
        "250 g steklökar (gärna röda)",
        "400 g färska champinjoner",
        "2 msk smör"
      ]
    },
    "steps": {
      "en": [
        "Cut the meat into pieces about 5x5 cm. Cut the pork belly into small cubes. Peel the shallots, garlic and carrots. Cut the shallots and carrots into large pieces. Slice the garlic.",
        "Sauté the shallots, garlic, carrots, half of the pork and tomato puree in a large pot in half the butter until the onion softens.",
        "Brown the meat in the remaining butter in a large frying pan until it turns brown all over. Add the water, let it boil for a minute and pour into the pot with the vegetable chopper. Dust with flour and stir. Add the wine, stock, soy, thyme and bay leaves.",
        "Bring to the boil and skim off the foam. Simmer over low heat with the lid ajar for about 1 ½–2 hours or until the meat is tender.",
        "Mashed potatoes: Peel and boil the potatoes in lightly salted water until soft. Drain and steam. Sauté the garlic in the butter. Pour in the cream and milk and bring to the boil. Mash the potatoes and whisk together with the onion cream. Add the lemon zest and season with salt.",
        "Mushroom fritters: Peel the onions and halve if they are large. Trim and halve the mushrooms. Fry the onions, mushrooms and the rest of the pork belly in the butter until they change colour and the onion is soft.",
        "Season the stew with salt and pepper. Top with the mushroom fritters and serve with the mashed potatoes."
      ],
      "zh": [
        "将肉切成约 5x5 厘米的小块。将五花肉切成小丁。将红葱头、大蒜和胡萝卜去皮。将红葱头和胡萝卜切成大块。将大蒜切片。",
        "在一个大锅中，用一半的黄油将红葱头、大蒜、胡萝卜、一半的猪肉和番茄泥炒香，直到洋葱变软。",
        "在一个大煎锅中，用剩余的黄油将肉煎至表面金黄。加水，煮沸一分钟，然后倒入装有蔬菜切碎器的锅中。撒上一些面粉并搅拌。加入葡萄酒、高汤、酱油、百里香和月桂叶。",
        "煮沸后撇去浮沫。盖上锅盖，留一条缝隙，用小火慢炖约 1.5-2 小时，或直到肉软烂。",
        "土豆泥：将土豆去皮，放入加了少许盐的水中煮至软烂。沥干水分，蒸熟。用黄油炒香大蒜。倒入奶油和牛奶，煮沸。将土豆捣成泥，与洋葱奶油搅拌均匀。加入柠檬皮屑，并用盐调味。",
        "蘑菇饼：将洋葱去皮，如果个头较大则切成两半。将蘑菇去蒂并切成两半。用黄油将洋葱、蘑菇和剩余的五花肉煎至变色且洋葱变软。",
        "将炖菜用盐和胡椒粉调味。将蘑菇饼放在炖菜上，与土豆泥一起食用。"
      ],
      "sv": [
        "Skär köttet i ca 5x5 cm stora bitar. Skär sidfläsket i små tärningar. Skala schalottenlök, vitlök och morötter. Skär schalottenlök och morötter i stora bitar. Skiva vitlöken.",
        "Fräs schalottenlök, vitlök, morötter, hälften av fläsket och tomatpurén i en stor gryta i hälften av smöret tills löken mjuknar.",
        "Bryn köttet i resten av smöret i en stor stekpanna tills det får färg runtom. Tillsätt vattnet, låt koka någon minut och häll ner i grytan med grönsaksfräset. Pudra över mjöl och rör om. Tillsätt vin, fond, soja, timjan och lagerblad.",
        "Låt koka upp och skumma av. Sjud på svag värme med locket på glänt ca 1 ½–2 timmar eller tills köttet är mört.",
        "Potatismos: Skala och koka potatisen mjuk i lättsaltat vatten. Häll av och ånga av. Fräs vitlöken i smöret. Häll i grädde och mjölk och låt koka upp. Pressa potatisen och vispa ihop med lökgrädden. Tillsätt citronskal och smaka av med salt.",
        "Svampfräs: Skala steklöken och halvera om de är stora. Ansa och halvera champinjonerna. Stek lök, champinjoner och resten av sidfläsket i smöret tills det får färg och löken är mjuk.",
        "Smaka av grytan med salt och peppar. Toppa med svampfräset och servera med potatismoset."
      ]
    },
    "tags": [],
    "cooking_method": {
      "en": "",
      "zh": "",
      "sv": ""
    },
    "taste_preferences": [
      "rich",
      "sour",
      "salty"
    ],
    "image_url": "/Recipe Image/Europe/EU-SW-005.png"
  },
  {
    "id": "EU-SW-006",
    "region": {
      "en": "Europe",
      "zh": "欧洲",
      "sv": "Europa"
    },
    "subcategory": {
      "en": "Sweden",
      "zh": "瑞典",
      "sv": "Sweden"
    },
    "dish_name": {
      "en": "Roasted chicken in the oven",
      "zh": "烤箱烤鸡",
      "sv": "Helstekt kyckling i ugn"
    },
    "description": {
      "en": "This is a classic, comforting dish featuring a whole chicken seasoned simply and oven-baked until the skin is crisp and the meat is perfectly tender and juicy.",
      "zh": "这是一道经典的家常菜，选用整只鸡，简单调味后放入烤箱烘烤，直至鸡皮酥脆，鸡肉鲜嫩多汁。",
      "sv": "Detta är en klassisk, tröstande rätt med en hel kyckling som är enkelt kryddad och ugnsbakad tills skinnet är krispigt och köttet är perfekt mört och saftigt."
    },
    "total_time_min": null,
    "difficulty": {
      "en": "Easy",
      "zh": "简单",
      "sv": "Lätt"
    },
    "servings": 4,
    "main_type": {
      "en": "Meat",
      "zh": "肉类",
      "sv": "Kött"
    },
    "ingredients": {
      "en": [
        "1 whole chicken (approx. 1.1 kg)",
        "2 tbsp oil",
        "1 tbsp Dijon mustard",
        "1 tbsp Japanese soy sauce",
        "1 tbsp honey",
        "2 tbsp chopped fresh herbs (e.g. rosemary, thyme or basil)",
        "1 1/2 tsp salt",
        "1/2 tsp black pepper",
        "1 dl water (for the pan)"
      ],
      "zh": [
        "整鸡一只（约1.1公斤）",
        "油2汤匙",
        "第戎芥末酱1汤匙",
        "日式酱油1汤匙",
        "蜂蜜1汤匙",
        "切碎的新鲜香草2汤匙（例如迷迭香、百里香或罗勒）",
        "盐1.5茶匙",
        "黑胡椒0.5茶匙",
        "水1分升（用于煎锅）"
      ],
      "sv": [
        "1 hel kyckling (à ca 1,1 kg)",
        "2 msk olja",
        "1 msk dijonsenap",
        "1 msk japansk soja",
        "1 msk honung",
        "2 msk hackade färska örter (t ex rosmarin, timjan eller basilika)",
        "1 1/2 tsk salt",
        "1/2 tsk svartpeppar",
        "1 dl vatten (till formen)"
      ]
    },
    "steps": {
      "en": [
        "Set the oven to 200°C.",
        "Place the chicken in a baking dish. Mix the other ingredients and brush the chicken all over. Pour the water into the dish.",
        "Place in the lower part of the oven for 30 minutes. Lower the temperature to 175°C and leave for another hour until the internal temperature is 82°C near the bone. Baste the chicken with the sauce from time to time.",
        "Let the chicken rest for 15 minutes before serving."
      ],
      "zh": [
        "将烤箱预热至200°C。",
        "将鸡肉放入烤盘中。混合其他配料，均匀涂抹在鸡肉上。倒入水。",
        "放入烤箱下层烤30分钟。将温度调至175°C，继续烤1小时，直至鸡肉内部温度（靠近骨头处）达到82°C。期间不时用酱汁涂抹鸡肉。                                                                                                                                                                                                                                        食用前静置15分钟。"
      ],
      "sv": [
        "Sätt ugnen på 200°C.",
        "Lägg kycklingen i en ugnsform. Blanda övriga ingredienser och pensla kycklingen runtom. Häll vattnet i formen.",
        "Ställ in i nedre delen av ugnen 30 minuter. Sänk temperaturen till 175°C och låt stå ytterligare ca 1 timme tills innertemperaturen är 82°C intill benet. Ös kycklingen då och då med skyn.                                                                                 Låt kycklingen vila 15 minuter innan servering."
      ]
    },
    "tags": [],
    "cooking_method": {
      "en": "",
      "zh": "",
      "sv": ""
    },
    "taste_preferences": [
      "mild",
      "salty",
      "rich"
    ],
    "image_url": "/Recipe Image/Europe/EU-SW-006.png"
  }
]
